-- MySQL dump 10.13  Distrib 8.0.28, for Win64 (x86_64)
--
-- Host: localhost    Database: order_management
-- ------------------------------------------------------
-- Server version	8.0.28

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `appeal`
--

DROP TABLE IF EXISTS `appeal`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `appeal` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `username` varchar(50) NOT NULL,
  `shop_name` varchar(100) DEFAULT NULL,
  `status` varchar(20) DEFAULT NULL,
  `type` varchar(50) DEFAULT NULL,
  `content` text,
  `contact` varchar(100) DEFAULT NULL,
  `reply` text,
  `reply_status` varchar(20) DEFAULT 'PENDING',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `reply_time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `appeal`
--

LOCK TABLES `appeal` WRITE;
/*!40000 ALTER TABLE `appeal` DISABLE KEYS */;
INSERT INTO `appeal` (`id`, `username`, `shop_name`, `status`, `type`, `content`, `contact`, `reply`, `reply_status`, `create_time`, `reply_time`) VALUES (1,'鐞惇','鐞惇澶ч厭搴?,'BANNED','璐﹀彿瑙ｅ皝','鎴戞槸鍐ゆ瀴鐨?,'13856548962','鈺?鈺?鈺?鈺?,'PROCESSED','2026-06-12 02:34:30','2026-06-12 02:45:23'),(2,'rujia','濡傚閰掑簵','NORMAL','閰掑簵瑙ｅ皝','銆愰厭搴楃敵璇夈€戦厭搴桰D:7锛岄厭搴楀悕绉?濡傚閰掑簵\n绂佺敤鍘熷洜:杩濊缁忚惀\n\n鐢宠瘔鍐呭:娌℃湁杩濊鎿嶄綔锛屽缓璁噸鏂板鏍?,'13809524762','瀹℃牳鍚庯紝纭閫氳繃','PROCESSED','2026-06-13 06:42:36','2026-06-13 06:43:23'),(3,'rujia','濡傚閰掑簵','NORMAL','閰掑簵瑙ｅ皝','銆愰厭搴楃敵璇夈€戦厭搴桰D:7锛岄厭搴楀悕绉?濡傚閰掑簵\n绂佺敤鍘熷洜:杩濊缁忚惀\n\n鐢宠瘔鍐呭:骞舵棤杩濊鎿嶄綔','13856479214','鏀跺埌','PROCESSED','2026-06-13 06:50:55','2026-06-13 06:51:19'),(4,'濡傚','濡傚澶ч厭搴?,'BANNED','淇℃伅淇敼','鎴戞槸ysn锛岃刀绱х粰鎴戣В浜嗭紝鐭ラ亾鎴戞槸璋佸悧锛?,'15986538213','gun','REJECTED','2026-06-14 06:41:48','2026-06-14 06:42:15'),(5,'鐞惇','鐞惇澶ч厭搴?,'BANNED','璐﹀彿瑙ｅ皝','瑙ｅ皝','138456987559','ok','PROCESSED','2026-06-16 01:06:42','2026-06-16 01:07:07'),(6,'鐞惇','鐞惇澶ч厭搴?,'BANNED','璐﹀彿瑙ｅ皝','123','15917029371','ok','PROCESSED','2026-06-16 01:53:34','2026-06-18 03:15:14'),(7,'鐞惇','鐞惇澶ч厭搴?,'BANNED','璐﹀彿瑙ｅ皝','123','1591283712','濂界殑','PROCESSED','2026-06-16 01:58:36','2026-06-16 02:02:04');
/*!40000 ALTER TABLE `appeal` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `attraction`
--

DROP TABLE IF EXISTS `attraction`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `attraction` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '鏅偣鍚嶇О',
  `province` varchar(100) NOT NULL COMMENT '鎵€鍦ㄧ渷浠?,
  `photo` varchar(500) DEFAULT NULL COMMENT '鏅偣鐓х墖URL',
  `description` text COMMENT '鏅偣绠€浠嬭鎯?,
  `score` double DEFAULT NULL,
  `city` varchar(255) DEFAULT NULL,
  `latitude` double DEFAULT NULL,
  `level` varchar(255) DEFAULT NULL,
  `longitude` double DEFAULT NULL,
  `open_time` varchar(255) DEFAULT NULL,
  `ticket_price` double DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=219 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='鏅偣琛?;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `attraction`
--

LOCK TABLES `attraction` WRITE;
/*!40000 ALTER TABLE `attraction` DISABLE KEYS */;
INSERT INTO `attraction` (`id`, `name`, `province`, `photo`, `description`, `score`, `city`, `latitude`, `level`, `longitude`, `open_time`, `ticket_price`, `type`) VALUES (1,'涔濆娌?,'鍥涘窛鐪?,'/file/674fbe64-e004-42eb-905a-2167af6fde7f_6d200e1e-8148-47ec-8c57-8db3f26d4f14_鍥涘窛涔濆娌?jpg',NULL,5,NULL,33.142376,NULL,103.912874,NULL,NULL,NULL),(2,'娲礀娲?,'閲嶅簡甯?,'/file/6e028fff-05fa-4b26-aec5-e4058319efb9_902c37dd-59e4-41da-9bb2-6df6499fd9f1_閲嶅簡娲礀娲?png',NULL,NULL,NULL,29.562321,NULL,106.579169,NULL,NULL,NULL),(3,'甯冭揪鎷夊','瑗胯棌鑷不鍖?,'/file/c3f66b74-eba6-42e7-83f6-7b813a3accfa_41a0bea0-2e10-47e7-94a6-219442ffffcf_瑗胯棌甯冭揪鎷夊.png',NULL,NULL,NULL,29.654471,NULL,91.118463,NULL,NULL,NULL),(6,'鐜夐緳闆北','浜戝崡鐪?,'/file/cc8ba76b-45a3-4c60-bf69-897f59a3cbfc_457fc9e4-aefa-45c4-9473-8ab4bc8fc0c4_浜戝崡鐜夐緳闆北.png',NULL,NULL,NULL,27.098052,NULL,100.258558,NULL,NULL,NULL),(7,'涓婃捣杩＋灏间箰鍥?,'涓婃捣甯?,'/file/14e161d8-913a-4f54-8024-6ddfc9435490_16f408dd-7e04-4676-9643-4555959206d6_涓婃捣杩＋灏间箰鍥?png',NULL,NULL,NULL,31.143212,NULL,121.660294,NULL,NULL,NULL),(8,'闀垮煄','鍖椾含甯?,'/file/d7446f90-7c8f-4858-b63f-9138ac7355a0_42fd328c-0c49-4330-92e6-1c974bdce920_鍖椾含闀垮煄.png',NULL,NULL,NULL,39.861412,NULL,116.279032,NULL,NULL,NULL),(10,'鏁呭鍗氱墿闄?,'鍖椾含甯?,'',NULL,4.5,'鍖椾含甯?,39.917839,'',116.397029,'',0,'椋庢櫙鍚嶈儨'),(11,'棰愬拰鍥?,'鍖椾含甯?,'',NULL,4.5,'鍖椾含甯?,39.999617,'',116.275179,'',0,'椋庢櫙鍚嶈儨'),(12,'鍏揪宀暱鍩?,'鍖椾含甯?,'',NULL,4.5,'鍖椾含甯?,40.356188,'',116.016802,'',0,'椋庢櫙鍚嶈儨'),(13,'澶╁潧鍏洯','鍖椾含甯?,'',NULL,4.5,'鍖椾含甯?,39.881913,'',116.410829,'',0,'椋庢櫙鍚嶈儨'),(14,'鎭帇搴?,'鍖椾含甯?,'',NULL,4.5,'鍖椾含甯?,39.935707,'',116.38648,'',0,'椋庢櫙鍚嶈儨'),(15,'鏄庡崄涓夐櫟','鍖椾含甯?,'',NULL,4.5,'鍖椾含甯?,40.280532,'',116.235741,'',0,'椋庢櫙鍚嶈儨'),(16,'鎱曠敯宄暱鍩?,'鍖椾含甯?,'',NULL,4.5,'鍖椾含甯?,40.417123,'',116.544676,'',0,'椋庢櫙鍚嶈儨'),(17,'澶╂触鍙ゆ枃鍖栬鏃呮父鍖?,'澶╂触甯?,'',NULL,4.5,'澶╂触甯?,39.143853,'',117.192281,'',0,'椋庢櫙鍚嶈儨'),(18,'澶╂触鐩樺北椋庢櫙鍚嶈儨鍖?,'澶╂触甯?,'',NULL,4.5,'澶╂触甯?,40.097171,'',117.282351,'',0,'椋庢櫙鍚嶈儨'),(19,'澶╂触榛勫礀鍏抽暱鍩?,'澶╂触甯?,'',NULL,4.5,'澶╂触甯?,40.247997,'',117.449095,'',0,'椋庢櫙鍚嶈儨'),(20,'涓婃捣涓滄柟鏄庣彔骞挎挱鐢佃濉?,'涓婃捣甯?,'',NULL,4.5,'涓婃捣甯?,31.239703,'',121.499718,'',0,'椋庢櫙鍚嶈儨'),(21,'涓婃捣閲庣敓鍔ㄧ墿鍥?,'涓婃捣甯?,'',NULL,4.5,'涓婃捣甯?,31.055337,'',121.721793,'',0,'椋庢櫙鍚嶈儨'),(22,'涓婃捣绉戞妧棣?,'涓婃捣甯?,'',NULL,4.5,'涓婃捣甯?,31.218114,'',121.541358,'',0,'椋庢櫙鍚嶈儨'),(23,'涓婃捣璞洯','涓婃捣甯?,'',NULL,4.5,'涓婃捣甯?,31.227714,'',121.492497,'',0,'椋庢櫙鍚嶈儨'),(24,'閲嶅簡澶ц冻鐭冲埢','閲嶅簡甯?,'',NULL,4.5,'閲嶅簡甯?,29.746913,'',105.788535,'',0,'椋庢櫙鍚嶈儨'),(25,'閲嶅簡宸北灏忎笁宄?,'閲嶅簡甯?,'',NULL,4.5,'閲嶅簡甯?,31.087473,'',109.913787,'',0,'椋庢櫙鍚嶈儨'),(26,'閲嶅簡姝﹂殕鍠€鏂壒鏃呮父鍖?,'閲嶅簡甯?,'',NULL,4.5,'閲嶅簡甯?,29.372488,'',107.784183,'',0,'椋庢櫙鍚嶈儨'),(27,'閲嶅簡閰夐槼妗冭姳婧?,'閲嶅簡甯?,'',NULL,4.5,'閲嶅簡甯?,28.858176,'',108.752353,'',0,'椋庢櫙鍚嶈儨'),(28,'閲嶅簡榛戝北璋?,'閲嶅簡甯?,'',NULL,4.5,'閲嶅簡甯?,28.919728,'',106.998418,'',0,'椋庢櫙鍚嶈儨'),(29,'閲嶅簡鍗楀窛閲戜經灞?,'閲嶅簡甯?,'',NULL,4.5,'閲嶅簡甯?,29.38288,'',106.521094,'',0,'椋庢櫙鍚嶈儨'),(30,'鎵垮痉閬挎殤灞卞簞鍙婂懆鍥村搴?,'娌冲寳鐪?,'',NULL,4.5,'鎵垮痉甯?,40.995449,'',117.934794,'',0,'椋庢櫙鍚嶈儨'),(31,'绉︾殗宀涘北娴峰叧鏅尯','娌冲寳鐪?,'',NULL,4.5,'绉︾殗宀涘競',39.970022,'',119.798682,'',0,'椋庢櫙鍚嶈儨'),(32,'淇濆畾瀹夋柊鐧芥磱娣€鏅尯','娌冲寳鐪?,'',NULL,4.5,'淇濆畾甯?,38.941265,'',115.97034,'',0,'椋庢櫙鍚嶈儨'),(33,'淇濆畾閲庝笁鍧℃櫙鍖?,'娌冲寳鐪?,'',NULL,4.5,'淇濆畾甯?,39.668405,'',115.385583,'',0,'椋庢櫙鍚嶈儨'),(34,'鐭冲搴勮タ鏌忓潯鏅尯','娌冲寳鐪?,'',NULL,4.5,'鐭冲搴勫競',38.342925,'',113.937425,'',0,'椋庢櫙鍚嶈儨'),(35,'閭兏濞茬殗瀹櫙鍖?,'娌冲寳鐪?,'',NULL,4.5,'閭兏甯?,36.633807,'',113.608482,'',0,'椋庢櫙鍚嶈儨'),(36,'鍞愬北娓呬笢闄垫櫙鍖?,'娌冲寳鐪?,'',NULL,4.5,'鍞愬北甯?,40.173542,'',117.6827,'',0,'椋庢櫙鍚嶈儨'),(37,'寮犲鍙ｅ磭绀兼粦闆梾娓稿害鍋囧尯','娌冲寳鐪?,'',NULL,4.5,'寮犲鍙ｅ競',41.114893,'',114.714973,'',0,'椋庢櫙鍚嶈儨'),(38,'澶у悓浜戝唸鐭崇獰','灞辫タ鐪?,'',NULL,4.5,'澶у悓甯?,40.113157,'',113.137763,'',0,'椋庢櫙鍚嶈儨'),(39,'蹇诲窞浜斿彴灞遍鏅悕鑳滃尯','灞辫タ鐪?,'',NULL,4.5,'蹇诲窞甯?,38.967437,'',113.590117,'',0,'椋庢櫙鍚嶈儨'),(40,'鏅嬪煄鐨囧煄鐩稿簻鐢熸€佹枃鍖栨梾娓稿尯','灞辫タ鐪?,'',NULL,4.5,'鏅嬪煄甯?,35.514833,'',112.582663,'',0,'椋庢櫙鍚嶈儨'),(41,'鏅嬩腑骞抽仴鍙ゅ煄','灞辫タ鐪?,'',NULL,4.5,'鏅嬩腑甯?,37.204136,'',112.183509,'',0,'椋庢櫙鍚嶈儨'),(42,'涓存本灏у簷-鍗庨棬鏃呮父鍖?,'灞辫タ鐪?,'',NULL,4.5,'涓存本甯?,36.052041,'',111.488056,'',0,'椋庢櫙鍚嶈儨'),(43,'杩愬煄瑙ｅ窞鍏冲笣搴?,'灞辫タ鐪?,'',NULL,4.5,'杩愬煄甯?,34.908996,'',110.849258,'',0,'椋庢櫙鍚嶈儨'),(44,'娌堥槼妞嶇墿鍥?,'杈藉畞鐪?,'',NULL,4.5,'娌堥槼甯?,41.86233,'',123.649192,'',0,'椋庢櫙鍚嶈儨'),(45,'澶ц繛鑰佽檸婊╂捣娲嬪叕鍥?,'杈藉畞鐪?,'',NULL,4.5,'澶ц繛甯?,38.878386,'',121.674648,'',0,'椋庢櫙鍚嶈儨'),(46,'澶ц繛閲戠煶婊╁浗瀹舵梾娓稿害鍋囧尯','杈藉畞鐪?,'',NULL,4.5,'澶ц繛甯?,39.096033,'',121.995346,'',0,'椋庢櫙鍚嶈儨'),(47,'闉嶅北鍗冨北鏅尯','杈藉畞鐪?,'',NULL,4.5,'闉嶅北甯?,41.028716,'',123.142153,'',0,'椋庢櫙鍚嶈儨'),(48,'鏈邯姘存礊鏅尯','杈藉畞鐪?,'',NULL,4.5,'鏈邯甯?,41.300153,'',124.080348,'',0,'椋庢櫙鍚嶈儨'),(49,'閿﹀窞涓栧崥鍥?,'杈藉畞鐪?,'',NULL,4.5,'閿﹀窞甯?,40.904936,'',121.200718,'',0,'椋庢櫙鍚嶈儨'),(50,'闀跨櫧灞辨櫙鍖?,'鍚夋灄鐪?,'',NULL,4.5,'寤惰竟鏈濋矞鏃忚嚜娌诲窞',42.34664,'',128.207175,'',0,'椋庢櫙鍚嶈儨'),(51,'闀挎槬浼弧鐨囧鍗氱墿闄?,'鍚夋灄鐪?,'',NULL,4.5,'闀挎槬甯?,43.905618,'',125.348749,'',0,'椋庢櫙鍚嶈儨'),(52,'闀挎槬鍑€鏈堟江鏅尯','鍚夋灄鐪?,'',NULL,4.5,'闀挎槬甯?,43.801388,'',125.455345,'',0,'椋庢櫙鍚嶈儨'),(53,'鍚夋灄鏉捐姳婀栭鏅悕鑳滃尯','鍚夋灄鐪?,'',NULL,4.5,'鍚夋灄甯?,43.720569,'',126.702133,'',0,'椋庢櫙鍚嶈儨'),(54,'榛戞渤浜斿ぇ杩炴睜鏅尯','榛戦緳姹熺渷','',NULL,4.5,'榛戞渤甯?,48.705589,'',126.263187,'',0,'椋庢櫙鍚嶈儨'),(55,'鐗′腹姹熼暅娉婃箹鏅尯','榛戦緳姹熺渷','',NULL,4.5,'鐗′腹姹熷競',44.063163,'',128.951244,'',0,'椋庢櫙鍚嶈儨'),(56,'浼婃槬姹ゆ椇娌虫灄娴峰鐭虫櫙鍖?,'榛戦緳姹熺渷','',NULL,4.5,'浼婃槬甯?,48.445762,'',129.446123,'',0,'椋庢櫙鍚嶈儨'),(57,'鍗椾含澶瓙搴?绉︽樊椋庡厜甯?,'姹熻嫃鐪?,'',NULL,4.5,'鍗椾含甯?,32.020699,'',118.788972,'',0,'椋庢櫙鍚嶈儨'),(58,'鑻忓窞鍥灄锛堟嫏鏀垮洯銆佽檸涓樸€佺暀鍥級','姹熻嫃鐪?,'',NULL,4.5,'鑻忓窞甯?,31.324194,'',120.629211,'',0,'椋庢櫙鍚嶈儨'),(59,'鑻忓窞鍛ㄥ簞鍙ら晣','姹熻嫃鐪?,'',NULL,4.5,'鑻忓窞甯?,31.114744,'',120.85091,'',0,'椋庢櫙鍚嶈儨'),(60,'鏃犻敗褰辫鍩哄湴涓夊浗姘存祾鍩?,'姹熻嫃鐪?,'',NULL,4.5,'鏃犻敗甯?,31.475581,'',120.233152,'',0,'椋庢櫙鍚嶈儨'),(61,'鏃犻敗鐏靛北鑳滃','姹熻嫃鐪?,'',NULL,4.5,'鏃犻敗甯?,31.42592,'',120.100925,'',0,'椋庢櫙鍚嶈儨'),(62,'甯稿窞鐜悆鎭愰緳鍩?,'姹熻嫃鐪?,'',NULL,4.5,'甯稿窞甯?,31.821974,'',120.003559,'',0,'椋庢櫙鍚嶈儨'),(63,'闀囨睙閲戝北路鐒﹀北路鍖楀浐灞?,'姹熻嫃鐪?,'',NULL,4.5,'闀囨睙甯?,32.215409,'',119.41413,'',0,'椋庢櫙鍚嶈儨'),(64,'鎵窞鐦﹁タ婀?,'姹熻嫃鐪?,'',NULL,4.5,'鎵窞甯?,32.416669,'',119.418211,'',0,'椋庢櫙鍚嶈儨'),(65,'鍗楅€氭繝娌抽鏅悕鑳滃尯','姹熻嫃鐪?,'',NULL,4.5,'鍗楅€氬競',32.014345,'',120.867057,'',0,'椋庢櫙鍚嶈儨'),(66,'娉板窞婧辨箹鍥藉婀垮湴鍏洯','姹熻嫃鐪?,'',NULL,4.5,'娉板窞甯?,32.612967,'',120.084874,'',0,'椋庢櫙鍚嶈儨'),(67,'寰愬窞浜戦緳婀栭鏅尯','姹熻嫃鐪?,'',NULL,4.5,'寰愬窞甯?,34.237488,'',117.151905,'',0,'椋庢櫙鍚嶈儨'),(68,'娣畨鍛ㄦ仼鏉ユ晠閲?,'姹熻嫃鐪?,'',NULL,4.5,'娣畨甯?,33.512579,'',119.152929,'',0,'椋庢櫙鍚嶈儨'),(69,'鐩愬煄涓崕楹嬮箍鍥?,'姹熻嫃鐪?,'',NULL,4.5,'鐩愬煄甯?,32.984013,'',120.815458,'',0,'椋庢櫙鍚嶈儨'),(70,'杩炰簯娓姳鏋滃北','姹熻嫃鐪?,'',NULL,4.5,'杩炰簯娓競',34.636038,'',119.288843,'',0,'椋庢櫙鍚嶈儨'),(71,'鏉窞瑗挎箹椋庢櫙鍚嶈儨鍖?,'娴欐睙鐪?,'',NULL,4.5,'鏉窞甯?,30.222692,'',120.121358,'',0,'椋庢櫙鍚嶈儨'),(72,'鑸熷北鏅檧灞?,'娴欐睙鐪?,'',NULL,4.5,'鑸熷北甯?,30.001867,'',122.391425,'',0,'椋庢櫙鍚嶈儨'),(73,'娓╁窞闆佽崱灞?,'娴欐睙鐪?,'',NULL,4.5,'娓╁窞甯?,27.582352,'',120.220787,'',0,'椋庢櫙鍚嶈儨'),(74,'瀹佹尝婧彛-婊曞ご鏃呮父鏅尯','娴欐睙鐪?,'',NULL,4.5,'瀹佹尝甯?,29.701225,'',121.389523,'',0,'椋庢櫙鍚嶈儨'),(75,'鍢夊叴涔岄晣鍙ら晣','娴欐睙鐪?,'',NULL,4.5,'鍢夊叴甯?,30.748979,'',120.486173,'',0,'椋庢櫙鍚嶈儨'),(76,'鍢夊叴鍗楁箹鏃呮父鍖?,'娴欐睙鐪?,'',NULL,4.5,'鍢夊叴甯?,30.753681,'',120.753137,'',0,'椋庢櫙鍚嶈儨'),(77,'缁嶅叴椴佽繀鏁呴噷-娌堝洯','娴欐睙鐪?,'',NULL,4.5,'缁嶅叴甯?,29.990303,'',120.590035,'',0,'椋庢櫙鍚嶈儨'),(78,'閲戝崕妯簵褰辫鍩?,'娴欐睙鐪?,'',NULL,4.5,'閲戝崕甯?,29.150418,'',120.304245,'',0,'椋庢櫙鍚嶈儨'),(79,'琛㈠窞姹熼儙灞卞豢鍏兘','娴欐睙鐪?,'',NULL,4.5,'琛㈠窞甯?,28.53113,'',118.56625,'',0,'椋庢櫙鍚嶈儨'),(80,'鍙板窞绁炰粰灞?,'娴欐睙鐪?,'',NULL,4.5,'鍙板窞甯?,28.693292,'',120.608247,'',0,'椋庢櫙鍚嶈儨'),(81,'涓芥按缂欎簯浠欓兘','娴欐睙鐪?,'',NULL,4.5,'涓芥按甯?,28.685408,'',120.132563,'',0,'椋庢櫙鍚嶈儨'),(82,'鍚堣偉涓夋渤鍙ら晣','瀹夊窘鐪?,'',NULL,4.5,'鍚堣偉甯?,31.511553,'',117.244782,'',0,'椋庢櫙鍚嶈儨'),(83,'榛勫北椋庢櫙鍖?,'瀹夊窘鐪?,'',NULL,4.5,'榛勫北甯?,30.139322,'',118.160164,'',0,'椋庢櫙鍚嶈儨'),(84,'榛勫北鐨栧崡鍙ゆ潙钀斤紙瑗块€捖峰畯鏉戯級','瀹夊窘鐪?,'',NULL,4.5,'榛勫北甯?,29.90334,'',117.99599,'',0,'椋庢櫙鍚嶈儨'),(85,'姹犲窞涔濆崕灞?,'瀹夊窘鐪?,'',NULL,4.5,'姹犲窞甯?,30.46505,'',117.826979,'',0,'椋庢櫙鍚嶈儨'),(86,'瀹夊簡澶╂煴灞?,'瀹夊窘鐪?,'',NULL,4.5,'瀹夊簡甯?,30.580865,'',117.055363,'',0,'椋庢櫙鍚嶈儨'),(87,'鍏畨澶╁爞瀵?,'瀹夊窘鐪?,'',NULL,4.5,'鍏畨甯?,31.139726,'',115.781037,'',0,'椋庢櫙鍚嶈儨'),(88,'瀹ｅ煄缁╂邯榫欏窛','瀹夊窘鐪?,'',NULL,4.5,'瀹ｅ煄甯?,30.075181,'',118.667414,'',0,'椋庢櫙鍚嶈儨'),(89,'鑺滄箹鏂圭壒鏃呮父鍖?,'瀹夊窘鐪?,'',NULL,4.5,'鑺滄箹甯?,31.358743,'',118.463334,'',0,'椋庢櫙鍚嶈儨'),(90,'绂忓窞涓夊潑涓冨贩','绂忓缓鐪?,'',NULL,4.5,'绂忓窞甯?,26.081958,'',119.296623,'',0,'椋庢櫙鍚嶈儨'),(91,'鍘﹂棬榧撴氮灞?,'绂忓缓鐪?,'',NULL,4.5,'鍘﹂棬甯?,24.446214,'',118.066102,'',0,'椋庢櫙鍚嶈儨'),(92,'姝﹀し灞?,'绂忓缓鐪?,'',NULL,4.5,'鍗楀钩甯?,27.374953,'',118.090091,'',0,'椋庢櫙鍚嶈儨'),(93,'娉夊窞娓呮簮灞?,'绂忓缓鐪?,'',NULL,4.5,'娉夊窞甯?,24.942414,'',118.610818,'',0,'椋庢櫙鍚嶈儨'),(94,'涓夋槑娉板畞澶ч噾婀?,'绂忓缓鐪?,'',NULL,4.5,'涓夋槑甯?,26.860743,'',117.101494,'',0,'椋庢櫙鍚嶈儨'),(95,'鍗楁槍婊曠帇闃?,'姹熻タ鐪?,'',NULL,4.5,'鍗楁槍甯?,28.681332,'',115.881197,'',0,'椋庢櫙鍚嶈儨'),(96,'涔濇睙搴愬北','姹熻タ鐪?,'',NULL,4.5,'涔濇睙甯?,29.549505,'',115.992044,'',0,'椋庢櫙鍚嶈儨'),(97,'涓婇ザ涓夋竻灞?,'姹熻タ鐪?,'',NULL,4.5,'涓婇ザ甯?,28.376753,'',117.968916,'',0,'椋庢櫙鍚嶈儨'),(98,'楣版江榫欒檸灞?,'姹熻タ鐪?,'',NULL,4.5,'楣版江甯?,28.244313,'',117.022356,'',0,'椋庢櫙鍚嶈儨'),(99,'鍚夊畨浜曞唸灞?,'姹熻タ鐪?,'',NULL,4.5,'鍚夊畨甯?,26.748132,'',114.289563,'',0,'椋庢櫙鍚嶈儨'),(100,'鏅痉闀囧彜绐戞皯淇楀崥瑙堝尯','姹熻タ鐪?,'',NULL,4.5,'鏅痉闀囧競',29.28343,'',117.184813,'',0,'椋庢櫙鍚嶈儨'),(101,'璧ｅ窞鐟為噾鍏卞拰鍥芥憞绡?,'姹熻タ鐪?,'',NULL,4.5,'璧ｅ窞甯?,25.882924,'',115.997569,'',0,'椋庢櫙鍚嶈儨'),(102,'瀹滄槬鏄庢湀灞?,'姹熻タ鐪?,'',NULL,4.5,'瀹滄槬甯?,27.602069,'',114.262179,'',0,'椋庢櫙鍚嶈儨'),(103,'娴庡崡澶╀笅绗竴娉夋櫙鍖?,'灞变笢鐪?,'',NULL,4.5,'娴庡崡甯?,36.660934,'',117.015207,'',0,'椋庢櫙鍚嶈儨'),(104,'娉板畨娉板北','灞变笢鐪?,'',NULL,4.5,'娉板畨甯?,36.201784,'',117.086963,'',0,'椋庢櫙鍚嶈儨'),(105,'鏇查槣鏄庢晠鍩庯紙涓夊瓟锛?,'灞变笢鐪?,'',NULL,4.5,'娴庡畞甯?,35.592054,'',116.993282,'',0,'椋庢櫙鍚嶈儨'),(106,'闈掑矝宕傚北','灞变笢鐪?,'',NULL,4.5,'闈掑矝甯?,36.184922,'',120.618274,'',0,'椋庢櫙鍚嶈儨'),(107,'鐑熷彴钃幈闃?涓変粰灞?,'灞变笢鐪?,'',NULL,4.5,'鐑熷彴甯?,37.822367,'',120.785581,'',0,'椋庢櫙鍚嶈儨'),(108,'濞佹捣鍒樺叕宀?,'灞变笢鐪?,'',NULL,4.5,'濞佹捣甯?,37.504524,'',122.190069,'',0,'椋庢櫙鍚嶈儨'),(109,'涓存矀娌傝挋灞?,'灞变笢鐪?,'',NULL,4.5,'涓存矀甯?,35.559735,'',117.977193,'',0,'椋庢櫙鍚嶈儨'),(110,'鏋ｅ簞鍙板効搴勫彜鍩?,'灞变笢鐪?,'',NULL,4.5,'鏋ｅ簞甯?,34.557425,'',117.74211,'',0,'椋庢櫙鍚嶈儨'),(111,'娼嶅潑娌傚北椋庢櫙鍖?,'灞变笢鐪?,'',NULL,4.5,'娼嶅潑甯?,36.204613,'',118.708353,'',0,'椋庢櫙鍚嶈儨'),(112,'鏃ョ収涓囧钩鍙ｆ捣婊ㄩ鏅尯','灞变笢鐪?,'',NULL,4.5,'鏃ョ収甯?,35.411333,'',119.562731,'',0,'椋庢櫙鍚嶈儨'),(113,'閮戝窞灏戞灄瀵?,'娌冲崡鐪?,'',NULL,4.5,'閮戝窞甯?,34.507029,'',112.941373,'',0,'椋庢櫙鍚嶈儨'),(114,'娲涢槼榫欓棬鐭崇獰','娌冲崡鐪?,'',NULL,4.5,'娲涢槼甯?,34.567727,'',112.488826,'',0,'椋庢櫙鍚嶈儨'),(115,'鐒︿綔浜戝彴灞?,'娌冲崡鐪?,'',NULL,4.5,'鐒︿綔甯?,35.421124,'',113.428178,'',0,'椋庢櫙鍚嶈儨'),(116,'瀹夐槼娈峰','娌冲崡鐪?,'',NULL,4.5,'瀹夐槼甯?,36.12055,'',114.330309,'',0,'椋庢櫙鍚嶈儨'),(117,'寮€灏佹竻鏄庝笂娌冲洯','娌冲崡鐪?,'',NULL,4.5,'寮€灏佸競',34.806982,'',114.344418,'',0,'椋庢櫙鍚嶈儨'),(118,'娲涢槼鐧戒簯灞?,'娌冲崡鐪?,'',NULL,4.5,'娲涢槼甯?,33.761488,'',111.91804,'',0,'椋庢櫙鍚嶈儨'),(119,'骞抽《灞卞哀灞?涓師澶т經','娌冲崡鐪?,'',NULL,4.5,'骞抽《灞卞競',33.773552,'',112.457045,'',0,'椋庢櫙鍚嶈儨'),(120,'鏂颁埂鍏噷娌?,'娌冲崡鐪?,'',NULL,4.5,'鏂颁埂甯?,35.614005,'',113.571244,'',0,'椋庢櫙鍚嶈儨'),(121,'鍗楅槼鑰佺晫宀锋亹榫欓仐杩瑰洯','娌冲崡鐪?,'',NULL,4.5,'鍗楅槼甯?,33.016102,'',112.584753,'',0,'椋庢櫙鍚嶈儨'),(122,'姘稿煄鑺掔爛灞?,'娌冲崡鐪?,'',NULL,4.5,'鍟嗕笜甯?,34.191498,'',116.500185,'',0,'椋庢櫙鍚嶈儨'),(123,'姝︽眽榛勯工妤?,'婀栧寳鐪?,'',NULL,4.5,'姝︽眽甯?,30.544649,'',114.302467,'',0,'椋庢櫙鍚嶈儨'),(124,'瀹滄槍涓夊场澶у潩-灞堝師鏁呴噷','婀栧寳鐪?,'',NULL,4.5,'瀹滄槍甯?,30.828051,'',111.037958,'',0,'椋庢櫙鍚嶈儨'),(125,'鎭╂柦澶у场璋?鑵鹃緳娲?,'婀栧寳鐪?,'',NULL,4.5,'鎭╂柦鍦熷鏃忚嫍鏃忚嚜娌诲窞',30.403162,'',109.194306,'',0,'椋庢櫙鍚嶈儨'),(126,'绁炲啘鏋剁敓鎬佹梾娓稿尯','婀栧寳鐪?,'',NULL,4.5,'绁炲啘鏋舵灄鍖?,31.468841,'',110.251032,'',0,'椋庢櫙鍚嶈儨'),(127,'姝﹀綋灞?,'婀栧寳鐪?,'',NULL,4.5,'鍗佸牥甯?,32.39853,'',111.01028,'',0,'椋庢櫙鍚嶈儨'),(128,'鑽嗗窞鍙ゅ煄鍘嗗彶鏂囧寲鏃呮父鍖?,'婀栧寳鐪?,'',NULL,4.5,'鑽嗗窞甯?,30.35157,'',112.197642,'',0,'椋庢櫙鍚嶈儨'),(129,'榛勫唸涓滃潯璧ゅ','婀栧寳鐪?,'',NULL,4.5,'榛勫唸甯?,30.452494,'',114.867135,'',0,'椋庢櫙鍚嶈儨'),(130,'闀挎矙宀抽簱灞?姗樺瓙娲?,'婀栧崡鐪?,'',NULL,4.5,'闀挎矙甯?,28.167602,'',112.960324,'',0,'椋庢櫙鍚嶈儨'),(131,'寮犲鐣屾闄垫簮-澶╅棬灞?,'婀栧崡鐪?,'',NULL,4.5,'寮犲鐣屽競',29.032962,'',110.478686,'',0,'椋庢櫙鍚嶈儨'),(132,'琛￠槼鍗楀渤琛″北','婀栧崡鐪?,'',NULL,4.5,'琛￠槼甯?,27.245084,'',112.734305,'',0,'椋庢櫙鍚嶈儨'),(133,'婀樻江闊跺北鏃呮父鍖?,'婀栧崡鐪?,'',NULL,4.5,'婀樻江甯?,27.90831,'',112.495158,'',0,'椋庢櫙鍚嶈儨'),(134,'宀抽槼妤?鍚涘北宀?,'婀栧崡鐪?,'',NULL,4.5,'宀抽槼甯?,29.381124,'',113.094158,'',0,'椋庢櫙鍚嶈儨'),(135,'閮村窞涓滄睙婀?,'婀栧崡鐪?,'',NULL,4.5,'閮村窞甯?,25.921329,'',113.427716,'',0,'椋庢櫙鍚嶈儨'),(136,'婀樿タ鍑ゅ嚢鍙ゅ煄','婀栧崡鐪?,'',NULL,4.5,'婀樿タ鍦熷鏃忚嫍鏃忚嚜娌诲窞',27.948931,'',109.606267,'',0,'椋庢櫙鍚嶈儨'),(137,'甯稿痉妗冭姳婧?,'婀栧崡鐪?,'',NULL,4.5,'甯稿痉甯?,28.916308,'',111.643644,'',0,'椋庢櫙鍚嶈儨'),(138,'骞垮窞闀块殕鏃呮父搴﹀亣鍖?,'骞夸笢鐪?,'',NULL,4.5,'骞垮窞甯?,23.002063,'',113.322768,'',0,'椋庢櫙鍚嶈儨'),(139,'娣卞湷鍗庝鲸鍩庢梾娓稿害鍋囧尯','骞夸笢鐪?,'',NULL,4.5,'娣卞湷甯?,22.531366,'',113.988596,'',0,'椋庢櫙鍚嶈儨'),(140,'骞垮窞鐧戒簯灞?,'骞夸笢鐪?,'',NULL,4.5,'骞垮窞甯?,23.178095,'',113.289421,'',0,'椋庢櫙鍚嶈儨'),(141,'涓归湠灞?,'骞夸笢鐪?,'',NULL,4.5,'闊跺叧甯?,25.024326,'',113.744514,'',0,'椋庢櫙鍚嶈儨'),(142,'鐝犳捣闀块殕娴锋磱鐜嬪浗','骞夸笢鐪?,'',NULL,4.5,'鐝犳捣甯?,22.09875,'',113.538507,'',0,'椋庢櫙鍚嶈儨'),(143,'浣涘北瑗挎ǖ灞?,'骞夸笢鐪?,'',NULL,4.5,'浣涘北甯?,22.908475,'',112.976074,'',0,'椋庢櫙鍚嶈儨'),(144,'鎯犲窞缃楁诞灞?,'骞夸笢鐪?,'',NULL,4.5,'鎯犲窞甯?,23.112368,'',114.415587,'',0,'椋庢櫙鍚嶈儨'),(145,'姊呭窞闆佸崡椋炶尪鐢?,'骞夸笢鐪?,'',NULL,4.5,'姊呭窞甯?,24.380373,'',116.371405,'',0,'椋庢櫙鍚嶈儨'),(146,'闃虫睙娴烽櫟宀涘ぇ瑙掓咕','骞夸笢鐪?,'',NULL,4.5,'闃虫睙甯?,21.569849,'',111.847476,'',0,'椋庢櫙鍚嶈儨'),(147,'娓呰繙杩炲窞鍦颁笅娌?,'骞夸笢鐪?,'',NULL,4.5,'娓呰繙甯?,25.006742,'',112.32985,'',0,'椋庢櫙鍚嶈儨'),(148,'娴峰彛鍋囨棩娴锋哗鏃呮父鍖?,'娴峰崡鐪?,'',NULL,4.5,'娴峰彛甯?,20.036599,'',110.237188,'',0,'椋庢櫙鍚嶈儨'),(149,'涓変簹鍗楀北鏂囧寲鏃呮父鍖?,'娴峰崡鐪?,'',NULL,4.5,'涓変簹甯?,18.298366,'',109.208349,'',0,'椋庢櫙鍚嶈儨'),(150,'涓変簹铚堟敮娲插矝','娴峰崡鐪?,'',NULL,4.5,'涓変簹甯?,18.274443,'',109.727424,'',0,'椋庢櫙鍚嶈儨'),(151,'涓変簹澶у皬娲炲ぉ','娴峰崡鐪?,'',NULL,4.5,'涓変簹甯?,18.30089,'',109.158067,'',0,'椋庢櫙鍚嶈儨'),(152,'娴峰崡鍒嗙晫娲插矝','娴峰崡鐪?,'',NULL,4.5,'闄垫按榛庢棌鑷不鍘?,18.576845,'',110.201546,'',0,'椋庢櫙鍚嶈儨'),(153,'鎴愰兘闈掑煄灞?閮芥睙鍫?,'鍥涘窛鐪?,'',NULL,4.5,'鎴愰兘甯?,30.995431,'',103.618455,'',0,'椋庢櫙鍚嶈儨'),(154,'涔愬北宄ㄧ湁灞?,'鍥涘窛鐪?,'',NULL,4.5,'涔愬北甯?,29.601189,'',103.484557,'',0,'椋庢櫙鍚嶈儨'),(155,'闃垮潩涔濆娌?,'鍥涘窛鐪?,'',NULL,4.5,'闃垮潩钘忔棌缇屾棌鑷不宸?,33.142376,'',103.912874,'',0,'椋庢櫙鍚嶈儨'),(156,'闃垮潩榛勯緳','鍥涘窛鐪?,'',NULL,4.5,'闃垮潩钘忔棌缇屾棌鑷不宸?,31.899427,'',102.224504,'',0,'椋庢櫙鍚嶈儨'),(157,'涔愬北澶т經','鍥涘窛鐪?,'',NULL,4.5,'涔愬北甯?,29.544099,'',103.771388,'',0,'椋庢櫙鍚嶈儨'),(158,'鍖楀窛缇屽煄鏃呮父鍖?,'鍥涘窛鐪?,'',NULL,4.5,'缁甸槼甯?,31.808881,'',104.452488,'',0,'椋庢櫙鍚嶈儨'),(159,'鍗楀厖闃嗕腑鍙ゅ煄','鍥涘窛鐪?,'',NULL,4.5,'鍗楀厖甯?,31.571493,'',105.978024,'',0,'椋庢櫙鍚嶈儨'),(160,'骞垮畨閭撳皬骞虫晠閲?,'鍥涘窛鐪?,'',NULL,4.5,'骞垮畨甯?,30.518535,'',106.63648,'',0,'椋庢櫙鍚嶈儨'),(161,'鎴愰兘澶ч倯瀹変粊鍙ら晣','鍥涘窛鐪?,'',NULL,4.5,'鎴愰兘甯?,30.505134,'',103.62403,'',0,'椋庢櫙鍚嶈儨'),(162,'璐甸槼榛旂伒灞?,'璐靛窞鐪?,'',NULL,4.5,'璐甸槼甯?,26.598319,'',106.69223,'',0,'椋庢櫙鍚嶈儨'),(163,'瀹夐『榛勬灉鏍戠€戝竷','璐靛窞鐪?,'',NULL,4.5,'瀹夐『甯?,25.989377,'',105.669102,'',0,'椋庢櫙鍚嶈儨'),(164,'瀹夐『榫欏','璐靛窞鐪?,'',NULL,4.5,'瀹夐『甯?,26.106874,'',105.885762,'',0,'椋庢櫙鍚嶈儨'),(165,'姣曡妭鐧鹃噷鏉滈箖','璐靛窞鐪?,'',NULL,4.5,'姣曡妭甯?,27.215562,'',105.915622,'',0,'椋庢櫙鍚嶈儨'),(166,'榛斿崡鑽旀尝妯熸睙','璐靛窞鐪?,'',NULL,4.5,'榛斿崡甯冧緷鏃忚嫍鏃忚嚜娌诲窞',25.280047,'',107.760566,'',0,'椋庢櫙鍚嶈儨'),(167,'閬典箟璧ゆ按涓归湠','璐靛窞鐪?,'',NULL,4.5,'閬典箟甯?,28.399094,'',105.948589,'',0,'椋庢櫙鍚嶈儨'),(168,'閾滀粊姊靛噣灞?,'璐靛窞鐪?,'',NULL,4.5,'閾滀粊甯?,27.731555,'',109.189528,'',0,'椋庢櫙鍚嶈儨'),(169,'鏄嗘槑鐭虫灄','浜戝崡鐪?,'',NULL,4.5,'鏄嗘槑甯?,24.812964,'',103.325701,'',0,'椋庢櫙鍚嶈儨'),(170,'涓芥睙鐜夐緳闆北','浜戝崡鐪?,'',NULL,4.5,'涓芥睙甯?,26.855165,'',100.225936,'',0,'椋庢櫙鍚嶈儨'),(171,'澶х悊宕囧湥瀵轰笁濉?,'浜戝崡鐪?,'',NULL,4.5,'澶х悊鐧芥棌鑷不宸?,25.704129,'',100.143044,'',0,'椋庢櫙鍚嶈儨'),(172,'瑗垮弻鐗堢撼鐑甫妞嶇墿鍥?,'浜戝崡鐪?,'',NULL,4.5,'瑗垮弻鐗堢撼鍌ｆ棌鑷不宸?,22.010849,'',100.786669,'',0,'椋庢櫙鍚嶈儨'),(173,'杩簡鏅揪鎺浗瀹跺叕鍥?,'浜戝崡鐪?,'',NULL,4.5,'杩簡钘忔棌鑷不宸?,27.856299,'',99.951808,'',0,'椋庢櫙鍚嶈儨'),(174,'鏄嗘槑涓栧崥鍥?,'浜戝崡鐪?,'',NULL,4.5,'鏄嗘槑甯?,25.075276,'',102.763616,'',0,'椋庢櫙鍚嶈儨'),(175,'鑵惧啿鍜岄『鍙ら晣','浜戝崡鐪?,'',NULL,4.5,'淇濆北甯?,25.009423,'',98.456754,'',0,'椋庢櫙鍚嶈儨'),(176,'瑗垮畨绉﹀鐨囧叺椹繎','闄曡タ鐪?,'',NULL,4.5,'瑗垮畨甯?,34.388674,'',109.28372,'',0,'椋庢櫙鍚嶈儨'),(177,'瑗垮畨鍗庢竻姹?,'闄曡タ鐪?,'',NULL,4.5,'瑗垮畨甯?,34.363241,'',109.212025,'',0,'椋庢櫙鍚嶈儨'),(178,'寤跺畨榛勫笣闄?,'闄曡タ鐪?,'',NULL,4.5,'寤跺畨甯?,35.586331,'',109.270433,'',0,'椋庢櫙鍚嶈儨'),(179,'娓崡鍗庡北','闄曡タ鐪?,'',NULL,4.5,'娓崡甯?,34.520632,'',109.470962,'',0,'椋庢櫙鍚嶈儨'),(180,'瀹濋浮娉曢棬瀵?,'闄曡タ鐪?,'',NULL,4.5,'瀹濋浮甯?,34.438774,'',107.903411,'',0,'椋庢櫙鍚嶈儨'),(181,'鍟嗘礇閲戜笣宄?,'闄曡タ鐪?,'',NULL,4.5,'鍟嗘礇甯?,33.355401,'',110.565892,'',0,'椋庢櫙鍚嶈儨'),(182,'鍏板窞涓北妗?,'鐢樿們鐪?,'',NULL,4.5,'鍏板窞甯?,36.06514,'',103.816868,'',0,'椋庢櫙鍚嶈儨'),(183,'鍢夊唱鍏虫枃鐗╂櫙鍖?,'鐢樿們鐪?,'',NULL,4.5,'鍢夊唱鍏冲競',39.800827,'',98.227762,'',0,'椋庢櫙鍚嶈儨'),(184,'骞冲噳宕嗗硳灞?,'鐢樿們鐪?,'',NULL,4.5,'骞冲噳甯?,35.547444,'',106.530016,'',0,'椋庢櫙鍚嶈儨'),(185,'澶╂按楹︾Н灞辩煶绐?,'鐢樿們鐪?,'',NULL,4.5,'澶╂按甯?,34.350764,'',106.008075,'',0,'椋庢櫙鍚嶈儨'),(186,'鏁︾厡楦ｆ矙灞辨湀鐗欐硥','鐢樿們鐪?,'',NULL,4.5,'閰掓硥甯?,40.088833,'',94.680396,'',0,'椋庢櫙鍚嶈儨'),(187,'寮犳帠涓冨僵涓归湠','鐢樿們鐪?,'',NULL,4.5,'寮犳帠甯?,38.97201,'',100.062804,'',0,'椋庢櫙鍚嶈儨'),(188,'瑗垮畞濉斿皵瀵?,'闈掓捣鐪?,'',NULL,4.5,'瑗垮畞甯?,36.487524,'',101.567788,'',0,'椋庢櫙鍚嶈儨'),(189,'闈掓捣婀栨櫙鍖?,'闈掓捣鐪?,'',NULL,4.5,'娴峰崡钘忔棌鑷不宸?,36.872758,'',100.231696,'',0,'椋庢櫙鍚嶈儨'),(190,'浜掑姪鍦熸棌鏁呭湡鍥?,'闈掓捣鐪?,'',NULL,4.5,'娴蜂笢甯?,36.835065,'',101.938141,'',0,'椋庢櫙鍚嶈儨'),(191,'閾跺窛闀囧寳鍫¤タ閮ㄥ奖鍩?,'瀹佸鍥炴棌鑷不鍖?,'',NULL,4.5,'閾跺窛甯?,38.61538,'',106.071976,'',0,'椋庢櫙鍚嶈儨'),(192,'涓崼娌欏潯澶?,'瀹佸鍥炴棌鑷不鍖?,'',NULL,4.5,'涓崼甯?,37.500185,'',105.19677,'',0,'椋庢櫙鍚嶈儨'),(193,'鐭冲槾灞辨矙婀?,'瀹佸鍥炴棌鑷不鍖?,'',NULL,4.5,'鐭冲槾灞卞競',38.930806,'',106.365963,'',0,'椋庢櫙鍚嶈儨'),(194,'涔岄瞾鏈ㄩ綈澶╁北澶╂睜','鏂扮枂缁村惥灏旇嚜娌诲尯','',NULL,4.5,'鏄屽悏鍥炴棌鑷不宸?,44.102919,'',88.067381,'',0,'椋庢櫙鍚嶈儨'),(195,'鍚愰瞾鐣憽钀勬矡','鏂扮枂缁村惥灏旇嚜娌诲尯','',NULL,4.5,'鍚愰瞾鐣競',43.000687,'',89.24417,'',0,'椋庢櫙鍚嶈儨'),(196,'鍠€浠€鍙ゅ煄','鏂扮枂缁村惥灏旇嚜娌诲尯','',NULL,4.5,'鍠€浠€鍦板尯',39.471564,'',75.990724,'',0,'椋庢櫙鍚嶈儨'),(197,'浼婄妬閭ｆ媺鎻愯崏鍘?,'鏂扮枂缁村惥灏旇嚜娌诲尯','',NULL,4.5,'浼婄妬鍝堣惃鍏嬭嚜娌诲窞',43.92401,'',81.283663,'',0,'椋庢櫙鍚嶈儨'),(198,'闃垮嫆娉板杸绾虫柉婀?,'鏂扮枂缁村惥灏旇嚜娌诲尯','',NULL,4.5,'闃垮嫆娉板湴鍖?,48.764264,'',87.07132,'',0,'椋庢櫙鍚嶈儨'),(199,'宸撮煶閮鍗氭柉鑵炬箹','鏂扮枂缁村惥灏旇嚜娌诲尯','',NULL,4.5,'宸撮煶閮钂欏彜鑷不宸?,41.837244,'',86.725152,'',0,'椋庢櫙鍚嶈儨'),(200,'鍏嬫媺鐜涗緷榄旈鍩?,'鏂扮枂缁村惥灏旇嚜娌诲尯','',NULL,4.5,'鍏嬫媺鐜涗緷甯?,46.135149,'',85.733205,'',0,'椋庢櫙鍚嶈儨'),(201,'鍝堝瘑鍥炵帇搴?,'鏂扮枂缁村惥灏旇嚜娌诲尯','',NULL,4.5,'鍝堝瘑甯?,42.813228,'',93.49002,'',0,'椋庢櫙鍚嶈儨'),(202,'鍛煎拰娴╃壒澶у彫瀵?,'鍐呰挋鍙よ嚜娌诲尯','',NULL,4.5,'鍛煎拰娴╃壒甯?,40.799767,'',111.654236,'',0,'椋庢櫙鍚嶈儨'),(203,'閯傚皵澶氭柉鎴愬悏鎬濇睏闄?,'鍐呰挋鍙よ嚜娌诲尯','',NULL,4.5,'閯傚皵澶氭柉甯?,39.362636,'',109.806231,'',0,'椋庢櫙鍚嶈儨'),(204,'鍛间鸡璐濆皵婊℃床閲屽浗闂?,'鍐呰挋鍙よ嚜娌诲尯','',NULL,4.5,'鍛间鸡璐濆皵甯?,49.630182,'',117.353708,'',0,'椋庢櫙鍚嶈儨'),(205,'鍏村畨鐩熼樋灏斿北-鏌存渤','鍐呰挋鍙よ嚜娌诲尯','',NULL,4.5,'鍏村畨鐩?,46.966747,'',120.288571,'',0,'椋庢櫙鍚嶈儨'),(206,'璧ゅ嘲鍏嬩粈鍏嬭吘鐭抽樀','鍐呰挋鍙よ嚜娌诲尯','',NULL,4.5,'璧ゅ嘲甯?,43.977422,'',117.482637,'',0,'椋庢櫙鍚嶈儨'),(207,'閿℃灄閮嫆澶氫鸡婀?,'鍐呰挋鍙よ嚜娌诲尯','',NULL,4.5,'閿℃灄閮嫆鐩?,43.933212,'',116.047387,'',0,'椋庢櫙鍚嶈儨'),(208,'鎷夎惃甯冭揪鎷夊-澶ф槶瀵?,'瑗胯棌鑷不鍖?,'',NULL,4.5,'鎷夎惃甯?,29.649963,'',91.132648,'',0,'椋庢櫙鍚嶈儨'),(209,'鏋楄姖宸存澗鎺?,'瑗胯棌鑷不鍖?,'',NULL,4.5,'鏋楄姖甯?,30.007874,'',93.967899,'',0,'椋庢櫙鍚嶈儨'),(210,'鏃ュ杸鍒欑彔绌嗘湕鐜涘嘲澶ф湰钀?,'瑗胯棌鑷不鍖?,'',NULL,4.5,'鏃ュ杸鍒欏競',28.193178,'',86.828317,'',0,'椋庢櫙鍚嶈儨'),(211,'灞卞崡缇婂崜闆嶆帾','瑗胯棌鑷不鍖?,'',NULL,4.5,'灞卞崡甯?,29.190506,'',90.619256,'',0,'椋庢櫙鍚嶈儨'),(212,'鍗楀畞闈掔灞?,'骞胯タ澹棌鑷不鍖?,'',NULL,4.5,'鍗楀畞甯?,22.78866,'',108.395254,'',0,'椋庢櫙鍚嶈儨'),(213,'妗傛灄婕撴睙椋庢櫙鍚嶈儨鍖?,'骞胯タ澹棌鑷不鍖?,'',NULL,4.5,'妗傛灄甯?,25.147445,'',110.431685,'',0,'椋庢櫙鍚嶈儨'),(214,'妗傛灄鐙宄?鐜嬪煄','骞胯タ澹棌鑷不鍖?,'',NULL,4.5,'妗傛灄甯?,25.281648,'',110.299118,'',0,'椋庢櫙鍚嶈儨'),(215,'鍖楁捣閾舵哗','骞胯タ澹棌鑷不鍖?,'',NULL,4.5,'鍖楁捣甯?,21.40364,'',109.155721,'',0,'椋庢櫙鍚嶈儨'),(216,'鐧捐壊璧蜂箟绾康鍥?,'骞胯タ澹棌鑷不鍖?,'',NULL,4.5,'鐧捐壊甯?,23.902718,'',106.635597,'',0,'椋庢櫙鍚嶈儨'),(217,'鍗楀畞鏄嗕粦鍏?,'骞胯タ澹棌鑷不鍖?,'',NULL,4.5,'鍗楀畞甯?,23.090529,'',108.681946,'',0,'椋庢櫙鍚嶈儨'),(218,'妗傛灄涓ゆ睙鍥涙箹-璞″北','骞胯タ澹棌鑷不鍖?,'',NULL,4.5,'妗傛灄甯?,25.27269,'',110.295526,'',0,'椋庢櫙鍚嶈儨');
/*!40000 ALTER TABLE `attraction` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cart`
--

DROP TABLE IF EXISTS `cart`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cart` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `username` varchar(255) NOT NULL,
  `created_time` datetime DEFAULT NULL,
  `updated_time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cart`
--

LOCK TABLES `cart` WRITE;
/*!40000 ALTER TABLE `cart` DISABLE KEYS */;
INSERT INTO `cart` (`id`, `username`, `created_time`, `updated_time`) VALUES (2,'ldq','2026-06-12 03:34:03','2026-06-12 03:34:03');
/*!40000 ALTER TABLE `cart` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cart_item`
--

DROP TABLE IF EXISTS `cart_item`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cart_item` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `cart_id` bigint NOT NULL,
  `scenic_id` bigint NOT NULL,
  `scenic_name` varchar(255) DEFAULT NULL,
  `ticket_price` decimal(10,2) DEFAULT NULL,
  `quantity` int DEFAULT '1',
  `route_id` bigint DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `cart_id` (`cart_id`),
  CONSTRAINT `cart_item_ibfk_1` FOREIGN KEY (`cart_id`) REFERENCES `cart` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cart_item`
--

LOCK TABLES `cart_item` WRITE;
/*!40000 ALTER TABLE `cart_item` DISABLE KEYS */;
/*!40000 ALTER TABLE `cart_item` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `comment`
--

DROP TABLE IF EXISTS `comment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `comment` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `attraction_id` bigint DEFAULT NULL,
  `content` varchar(255) DEFAULT NULL,
  `create_time` datetime(6) DEFAULT NULL,
  `score` int DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comment`
--

LOCK TABLES `comment` WRITE;
/*!40000 ALTER TABLE `comment` DISABLE KEYS */;
INSERT INTO `comment` (`id`, `attraction_id`, `content`, `create_time`, `score`) VALUES (1,1,'闈炲父缇庝附~good锛実ood锛岀湡鏄痓eautiful鍟婏紒','2026-05-21 14:03:11.307000',5),(2,1,'濂界帺锛屾紓浜?,'2026-05-21 15:48:02.566000',5),(3,1,'濂藉ソ鐜?,'2026-05-22 05:31:54.805000',5),(4,2,'濂界湅','2026-05-22 05:33:57.298000',5),(5,2,'11','2026-05-22 06:02:30.744000',5),(6,9,'寰堝ソ','2026-05-29 02:28:10.090000',5);
/*!40000 ALTER TABLE `comment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `flight`
--

DROP TABLE IF EXISTS `flight`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `flight` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `flight_number` varchar(20) NOT NULL COMMENT '鑸彮鍙?,
  `airline` varchar(50) DEFAULT NULL COMMENT '鑸┖鍏徃',
  `depart_city` varchar(50) NOT NULL COMMENT '鍑哄彂鍩庡競',
  `arrive_city` varchar(50) NOT NULL COMMENT '鍒拌揪鍩庡競',
  `depart_time` datetime NOT NULL COMMENT '鍑哄彂鏃堕棿',
  `arrive_time` datetime NOT NULL COMMENT '鍒拌揪鏃堕棿',
  `price` decimal(10,2) NOT NULL COMMENT '浠锋牸',
  `remaining_seats` int DEFAULT '100' COMMENT '鍓╀綑搴т綅',
  `status` varchar(20) DEFAULT '鏈夋晥' COMMENT '鏈夋晥/宸插け鏁?,
  PRIMARY KEY (`id`),
  KEY `idx_depart_arrive` (`depart_city`,`arrive_city`),
  KEY `idx_depart_time` (`depart_time`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `flight`
--

LOCK TABLES `flight` WRITE;
/*!40000 ALTER TABLE `flight` DISABLE KEYS */;
/*!40000 ALTER TABLE `flight` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `flight_order`
--

DROP TABLE IF EXISTS `flight_order`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `flight_order` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `flight_id` bigint DEFAULT NULL,
  `flight_number` varchar(20) DEFAULT NULL COMMENT '鑸彮鍙?,
  `depart_city` varchar(50) DEFAULT NULL COMMENT '鍑哄彂鍩庡競',
  `arrive_city` varchar(50) DEFAULT NULL COMMENT '鍒拌揪鍩庡競',
  `depart_time` datetime DEFAULT NULL COMMENT '鍑哄彂鏃堕棿',
  `arrive_time` datetime DEFAULT NULL COMMENT '鍒拌揪鏃堕棿',
  `price` decimal(10,2) NOT NULL,
  `username` varchar(50) NOT NULL COMMENT '涓嬪崟鐢ㄦ埛',
  `passenger_name` varchar(50) NOT NULL COMMENT '涔樺濮撳悕',
  `passenger_id_card` varchar(18) NOT NULL COMMENT '韬唤璇佸彿',
  `contact_phone` varchar(20) DEFAULT NULL COMMENT '鑱旂郴鐢佃瘽',
  `status` varchar(20) DEFAULT '寰呮敮浠? COMMENT '寰呮敮浠?宸叉敮浠?宸插畬鎴?宸插彇娑?宸插け鏁?,
  `create_time` datetime DEFAULT NULL,
  `pay_time` datetime DEFAULT NULL,
  `cancel_time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `idx_username` (`username`),
  KEY `idx_status` (`status`),
  KEY `idx_flight_id` (`flight_id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `flight_order`
--

LOCK TABLES `flight_order` WRITE;
/*!40000 ALTER TABLE `flight_order` DISABLE KEYS */;
INSERT INTO `flight_order` (`id`, `flight_id`, `flight_number`, `depart_city`, `arrive_city`, `depart_time`, `arrive_time`, `price`, `username`, `passenger_name`, `passenger_id_card`, `contact_phone`, `status`, `create_time`, `pay_time`, `cancel_time`) VALUES (1,NULL,'CA1234','鍖椾含棣栭兘','涓婃捣铏规ˉ','2026-06-07 16:00:00','2026-06-07 18:30:00',850.00,'ysn','鏉ㄨ瘲璇?,'350111200501291602','13845678910','宸插嚭绁?,'2026-06-08 01:34:59',NULL,NULL),(2,NULL,'MU5678','鍖椾含澶у叴','涓婃捣娴︿笢','2026-06-07 22:00:00','2026-06-08 00:20:00',720.00,'ysn','鑻忓阀浜?,'350111200502182580','13915239871','宸插嚭绁?,'2026-06-08 01:36:41',NULL,NULL),(3,NULL,'CA1234','鍖椾含棣栭兘','涓婃捣铏规ˉ','2026-06-07 16:00:00','2026-06-07 18:30:00',850.00,'ysn','闄堝畨鐞?,'350111200507021589','13812581230','宸插彇娑?,'2026-06-08 01:41:23',NULL,'2026-06-08 01:44:53'),(4,NULL,'CA1234','鍖椾含棣栭兘','涓婃捣铏规ˉ','2026-06-15 00:00:00','2026-06-15 02:30:00',850.00,'ysn','闄堝畨鐞?,'350111200501159831','13845678910','宸叉敮浠?,'2026-06-08 01:45:46','2026-06-08 01:52:49',NULL),(5,NULL,'CA1234','鍖椾含棣栭兘','涓婃捣铏规ˉ','2026-06-16 00:00:00','2026-06-16 02:30:00',850.00,'caq','闄堝畨鐞?,'350111200507020181','15910284712','宸叉敮浠?,'2026-06-09 04:05:35','2026-06-09 04:10:21',NULL),(6,NULL,'HU7605','鍖椾含棣栭兘','涓婃捣铏规ˉ','2026-06-14 07:35:00','2026-06-14 09:45:00',1019.00,'ysn','鏉ㄨ瘲璇?,'350111200501121587','13809523547','宸叉敮浠?,'2026-06-13 07:56:50','2026-06-13 07:57:03',NULL),(7,NULL,'CA1507','鍖椾含棣栭兘','涓婃捣铏规ˉ','2026-06-15 23:30:00','2026-06-16 02:00:00',1268.00,'ysn','闄堜竷','350182200507020129','15910238713','宸叉敮浠?,'2026-06-14 06:19:33','2026-06-14 06:21:16',NULL),(8,NULL,'CA1234','鍖椾含棣栭兘','涓婃捣铏规ˉ','2026-06-21 00:00:00','2026-06-21 02:30:00',1700.00,'ysn','鏉ㄦ€濊嫢','350111200504151236','13856189416','宸插彇娑?,'2026-06-14 09:03:59',NULL,'2026-06-14 09:10:50'),(9,NULL,'CA1234','鍖椾含棣栭兘','涓婃捣铏规ˉ','2026-06-21 00:00:00','2026-06-21 02:30:00',850.00,'ysn','鏉ㄥ洓鏃?,'350111200502031236','13856189641','宸插彇娑?,'2026-06-14 09:10:36',NULL,NULL),(10,NULL,'CA1234','鍖椾含棣栭兘','涓婃捣铏规ˉ','2026-06-21 00:00:00','2026-06-21 02:30:00',850.00,'ysn','闄堝畨鍏?,'350111200503030125','13956418965','宸插彇娑?,'2026-06-14 09:10:36',NULL,'2026-06-14 09:10:48'),(11,NULL,'CA1234','鍖椾含棣栭兘','涓婃捣铏规ˉ','2026-06-22 00:00:00','2026-06-22 02:30:00',850.00,'ysn','涓ユ墜鍔?,'350111200501020123','13605619856','宸叉敮浠?,'2026-06-15 02:37:32','2026-06-15 02:37:54',NULL),(12,NULL,'CA1234','鍖椾含棣栭兘','涓婃捣铏规ˉ','2026-06-22 00:00:00','2026-06-22 02:30:00',850.00,'ysn','浜氫笣濞?,'350111200501010155','13805894562','宸叉敮浠?,'2026-06-15 02:41:30','2026-06-15 02:42:51',NULL);
/*!40000 ALTER TABLE `flight_order` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hotel`
--

DROP TABLE IF EXISTS `hotel`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hotel` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL COMMENT '閰掑簵鍚嶇О',
  `star_level` int NOT NULL COMMENT '閰掑簵鏄熺骇',
  `price` double NOT NULL COMMENT '閰掑簵瀹氫环',
  `cover_image` varchar(500) DEFAULT NULL COMMENT '灏侀潰鍥綰RL',
  `category` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `avg_rating` double DEFAULT NULL,
  `latitude` double DEFAULT NULL,
  `longitude` double DEFAULT NULL,
  `merchant_id` bigint DEFAULT NULL,
  `status` varchar(255) DEFAULT NULL,
  `total_rooms` int DEFAULT NULL,
  `update_time` datetime(6) DEFAULT NULL,
  `violation_reason` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='閰掑簵琛?;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hotel`
--

LOCK TABLES `hotel` WRITE;
/*!40000 ALTER TABLE `hotel` DISABLE KEYS */;
INSERT INTO `hotel` (`id`, `name`, `star_level`, `price`, `cover_image`, `category`, `address`, `avg_rating`, `latitude`, `longitude`, `merchant_id`, `status`, `total_rooms`, `update_time`, `violation_reason`) VALUES (7,'濡傚閰掑簵',4,199,'/file/f0acf3e9-56fb-4cab-8a9a-0552f95a7fed_r5VQ4h6CFMDW5dce6b93a8cd36f1480dba781a25c3f9.jpg','鍟嗗姟鍨嬮厭搴?,'绂忓缓鐪佺宸炲競榧撴ゼ鍖哄崡琛楄閬撳洯鍨辫28鍙?,4,26.082843903741153,119.29592287401374,4,'钀ヤ笟涓?,12,'2026-06-18 03:57:56.827000',NULL),(8,'棣欐牸閲屾媺澶ч厭搴?,5,299,'/file/ebaebb65-b2dc-483b-a339-318a113a8415_0Lfx54p8m2Tz7ab619cc636446422d1ec2f219bc15e9.png','杩為攣閰掑簵','绂忓缓鐪佺宸炲競榧撴ゼ鍖哄崡琛楄閬撳洯鍨辫21鍙?,5,26.083873066828442,119.29532324704803,5,'钀ヤ笟涓?,10,NULL,NULL),(9,'璇鸿澶ч厭搴?,5,1999,'/file/bd085b18-8369-4ab7-88d5-35dbef04e762_6IHoNkdZb2ZCc20563165a649286c79dae5954a5bd83.png','鍏瘬鍨嬮厭搴?,'娴欐睙鐪佽、宸炲競榫欐父鍘垮ぇ琛椾埂',5,28.833375347523205,119.26757876807858,6,'钀ヤ笟涓?,3,'2026-06-14 08:30:43.041000',NULL),(10,'鐞惇澶ч厭搴?,5,9999,'/file/f09d7114-6fd6-4ff9-8712-9269f91c80f7_sXyNV8HpYWOlc20563165a649286c79dae5954a5bd83.png','搴﹀亣鍨嬮厭搴?,'绂忓缓鐪佺宸炲競闂戒警鍘跨宀愪埂',0,26.109000961666094,119.17108934843498,7,'钀ヤ笟涓?,14,'2026-06-16 02:42:45.172000',NULL),(11,'璇鸿灏忛厭搴?,4,7799,'/file/7f236a14-7a61-4b06-856b-259d9002efd0_QaMME7WOSZBe5dce6b93a8cd36f1480dba781a25c3f9.jpg','鍟嗗姟鍨嬮厭搴?,'绂忓缓鐪佺宸炲競榧撴ゼ鍖烘椽灞遍晣鏌虫渤璺?8-鍗楅櫌',0,26.0815394805819,119.29492880935584,6,'钀ヤ笟涓?,5,'2026-06-16 03:15:47.082000',NULL),(12,'yunduo閰掑簵',5,159,'/file/64c6aa47-21a9-4dd0-ba9d-8c5b309d21a9_t7dsDZrAmyZFd12f0ba19391561f4cb2581fd592dcb8.png','鍟嗗姟鍨嬮厭搴?,'娴欐睙鐪佹澀宸炲競瑗挎箹鍖哄寳灞辫閬撴爾闇炲箔璺?,0,30.262636413565733,120.14463998490623,9,'钀ヤ笟涓?,25,'2026-06-23 02:52:04.179000',NULL);
/*!40000 ALTER TABLE `hotel` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hotel_image`
--

DROP TABLE IF EXISTS `hotel_image`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hotel_image` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `image_url` varchar(500) NOT NULL COMMENT '璇︽儏鍥綰RL',
  `hotel_id` bigint NOT NULL COMMENT '鍏宠仈閰掑簵ID',
  PRIMARY KEY (`id`),
  KEY `hotel_id` (`hotel_id`),
  CONSTRAINT `hotel_image_ibfk_1` FOREIGN KEY (`hotel_id`) REFERENCES `hotel` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=28 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='閰掑簵璇︽儏鍥捐〃';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hotel_image`
--

LOCK TABLES `hotel_image` WRITE;
/*!40000 ALTER TABLE `hotel_image` DISABLE KEYS */;
INSERT INTO `hotel_image` (`id`, `image_url`, `hotel_id`) VALUES (22,'/file/2778c490-2059-4b9c-a3aa-aca7d2a82e5e_XwThqaMDCcKc7ab619cc636446422d1ec2f219bc15e9.png',7),(23,'/file/562b8638-a5e0-4ef3-82a5-c60f6df21cfd_OEM5Ile0toVE5d8a2dab52562252cc095cd6e01fa2b5.png',7),(24,'/file/540f6961-abe3-4a62-8ae7-7feb4b83a484_7sFufaAqYrXPc20563165a649286c79dae5954a5bd83.png',10),(25,'/file/d026e506-2bd5-41a2-8427-ed2212029c04_So86BbYKg6Bk5dce6b93a8cd36f1480dba781a25c3f9.jpg',10),(26,'/file/d02280bb-aaa0-4fa1-86b5-c44e58d379e1_1Pn2YxRmhqFf5d8a2dab52562252cc095cd6e01fa2b5.png',10),(27,'/file/4e63382e-b37d-47f7-bc0d-ba80cc7ce0f2_Kj9yIXDvA9ZLc20563165a649286c79dae5954a5bd83.png',11);
/*!40000 ALTER TABLE `hotel_image` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hotelcomment`
--

DROP TABLE IF EXISTS `hotelcomment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hotelcomment` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `content` varchar(255) DEFAULT NULL,
  `create_time` datetime(6) DEFAULT NULL,
  `hotel_id` bigint DEFAULT NULL,
  `order_id` bigint DEFAULT NULL,
  `score` int DEFAULT NULL,
  `images` text,
  `status` varchar(255) DEFAULT NULL,
  `username` varchar(255) DEFAULT NULL,
  `reply` text,
  `reply_time` datetime(6) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hotelcomment`
--

LOCK TABLES `hotelcomment` WRITE;
/*!40000 ALTER TABLE `hotelcomment` DISABLE KEYS */;
INSERT INTO `hotelcomment` (`id`, `content`, `create_time`, `hotel_id`, `order_id`, `score`, `images`, `status`, `username`, `reply`, `reply_time`) VALUES (7,'寰堝ソ','2026-06-09 04:05:09.190000',9,18,5,NULL,'姝ｅ父',NULL,'鎰熻阿鎮ㄧ殑鏀寔锛?,'2026-06-12 09:10:05.000000'),(8,'鎸哄ソ鐨勶紝鑰佹澘浜哄緢濂?,'2026-06-11 02:17:23.904000',7,14,5,NULL,'姝ｅ父',NULL,'璋㈣阿鎮ㄧ殑璇勮~','2026-06-14 14:45:39.000000'),(9,'鐜鎸哄ソ鐨?,'2026-06-12 01:18:17.905000',8,22,5,NULL,'姝ｅ父','ysn','鎰熻阿鎮ㄧ殑鏀寔锛?,'2026-06-12 09:20:44.000000'),(10,'寰堝ソ锛岃€佹澘寰堝竻','2026-06-14 06:45:01.008000',7,19,3,NULL,'姝ｅ父','ysn','寰堝竻鎵嶄笁鏄燄煒?,'2026-06-14 14:45:58.000000');
/*!40000 ALTER TABLE `hotelcomment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hotelorder`
--

DROP TABLE IF EXISTS `hotelorder`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `hotelorder` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `check_in` varchar(255) DEFAULT NULL,
  `check_out` varchar(255) DEFAULT NULL,
  `create_time` datetime(6) DEFAULT NULL,
  `hotel_id` bigint DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `price` double DEFAULT NULL,
  `comment` varchar(255) DEFAULT NULL,
  `username` varchar(255) DEFAULT NULL,
  `cancel_reason` varchar(255) DEFAULT NULL,
  `contact_phone` varchar(255) DEFAULT NULL,
  `rating` int DEFAULT NULL,
  `room_count` int DEFAULT NULL,
  `room_type_id` bigint DEFAULT NULL,
  `room_type_name` varchar(255) DEFAULT NULL,
  `status` varchar(255) DEFAULT NULL,
  `cancel_time` datetime(6) DEFAULT NULL,
  `confirm_time` datetime(6) DEFAULT NULL,
  `reject_reason` varchar(255) DEFAULT NULL,
  `merchant_id` bigint DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=38 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hotelorder`
--

LOCK TABLES `hotelorder` WRITE;
/*!40000 ALTER TABLE `hotelorder` DISABLE KEYS */;
INSERT INTO `hotelorder` (`id`, `check_in`, `check_out`, `create_time`, `hotel_id`, `name`, `price`, `comment`, `username`, `cancel_reason`, `contact_phone`, `rating`, `room_count`, `room_type_id`, `room_type_name`, `status`, `cancel_time`, `confirm_time`, `reject_reason`, `merchant_id`) VALUES (13,'2026-06-09','2026-06-10','2026-06-08 02:52:24.224000',7,'濡傚閰掑簵',123,NULL,'ysn','浣犲ソ','13812345678',NULL,1,1,'澶у簥鎴?,'宸插彇娑?,'2026-06-08 03:27:25.301000','2026-06-08 03:15:51.908000',NULL,4),(14,'2026-06-09','2026-06-10','2026-06-08 03:36:09.155000',7,'濡傚閰掑簵',123,NULL,'ysn',NULL,'15923434134',NULL,1,1,'澶у簥鎴?,'宸插畬鎴?,NULL,'2026-06-08 03:36:39.013000',NULL,4),(16,'2026-06-10','2026-06-11','2026-06-09 02:11:08.909000',7,'濡傚閰掑簵',123,NULL,'rujia',NULL,'15932165653',NULL,1,1,'澶у簥鎴?,'宸插畬鎴?,NULL,'2026-06-09 03:53:45.441000',NULL,4),(18,'2026-06-10','2026-06-11','2026-06-09 03:44:02.658000',9,'璇鸿澶ч厭搴?,8999,NULL,'caq',NULL,'15956746534',NULL,1,2,'鎬荤粺鎴?,'宸插畬鎴?,NULL,'2026-06-09 03:44:46.130000',NULL,6),(19,'2026-06-13','2026-06-14','2026-06-12 00:42:27.841000',7,'濡傚閰掑簵',230,NULL,'ysn',NULL,'13812595633',NULL,2,3,'鍙屼汉闂?,'宸插畬鎴?,NULL,'2026-06-12 00:43:16.291000',NULL,4),(20,'2026-06-13','2026-06-14','2026-06-12 01:02:11.641000',8,'棣欐牸閲屾媺澶ч厭搴?,125,NULL,'ysn',NULL,'13802594521',NULL,1,5,'鍙屼汉闂?,'宸茬‘璁?,NULL,'2026-06-12 01:03:06.825000',NULL,5),(21,'2026-06-13','2026-06-14','2026-06-12 01:14:27.034000',9,'璇鸿澶ч厭搴?,8999,NULL,'ysn','浣忎笉璧?,'13856425562',NULL,1,2,'鎬荤粺鎴?,'宸插彇娑?,'2026-06-16 03:18:33.279000','2026-06-12 01:14:57.178000',NULL,6),(22,'2026-06-12','2026-06-13','2026-06-12 01:16:08.561000',8,'棣欐牸閲屾媺澶ч厭搴?,105,NULL,'ysn',NULL,'13695484522',NULL,1,4,'鍗曚汉闂?,'宸插畬鎴?,NULL,'2026-06-12 01:17:42.199000',NULL,5),(23,'2026-06-15','2026-06-16','2026-06-14 06:13:38.815000',7,'濡傚閰掑簵',246,NULL,'ysn',NULL,'15880567621',NULL,2,1,'澶у簥鎴?,'宸插畬鎴?,NULL,'2026-06-14 06:29:33.786000',NULL,4),(24,'2026-06-16','2026-06-17','2026-06-15 02:36:35.191000',7,'濡傚閰掑簵',123,NULL,'ysn',NULL,'13825614856',NULL,1,1,'澶у簥鎴?,'宸插畬鎴?,NULL,'2026-06-18 01:28:44.658000',NULL,4),(25,'2026-06-16','2026-06-17','2026-06-15 02:49:43.918000',10,'鐞惇澶ч厭搴?,9888,NULL,'ysn',NULL,'13806828994',NULL,1,7,'鎬荤粺濂楁埧','寰呯‘璁?,NULL,NULL,NULL,7),(26,'2026-06-17','2026-06-18','2026-06-16 02:37:18.860000',10,'鐞惇澶ч厭搴?,9888,NULL,'ysn',NULL,'15954165189',NULL,1,7,'鎬荤粺濂楁埧','寰呮敮浠?,NULL,NULL,NULL,7),(27,'2026-06-17','2026-06-18','2026-06-16 03:17:47.001000',11,'璇鸿灏忛厭搴?,7799,NULL,'ysn',NULL,'15951654651',NULL,1,8,'鎬荤粺鎴?,'宸插畬鎴?,NULL,'2026-06-16 03:18:35.161000',NULL,6),(28,'2026-06-19','2026-06-20','2026-06-18 00:45:38.243000',11,'璇鸿灏忛厭搴?,7799,NULL,'ysn','涓嶈鑴?,'13586451320',NULL,1,8,'鎬荤粺鎴?,'宸插彇娑?,'2026-06-18 00:54:43.864000','2026-06-18 00:46:43.505000',NULL,6),(29,'2026-06-19','2026-06-20','2026-06-18 00:50:16.148000',11,'璇鸿灏忛厭搴?,7799,NULL,'ysn','test','13987465132',NULL,1,8,'鎬荤粺鎴?,'宸插彇娑?,'2026-06-18 00:54:42.115000',NULL,NULL,6),(30,'2026-06-19','2026-06-20','2026-06-18 01:14:22.575000',11,'璇鸿灏忛厭搴?,7799,NULL,'ysn',NULL,'15868412348',NULL,1,8,'鎬荤粺鎴?,'宸茬‘璁?,NULL,'2026-06-18 01:15:27.169000',NULL,6),(31,'2026-06-19','2026-06-20','2026-06-18 01:28:00.178000',7,'濡傚閰掑簵',123,NULL,'ysn',NULL,'13576986451',NULL,1,1,'澶у簥鎴?,'宸茬‘璁?,NULL,'2026-06-18 01:28:50.196000',NULL,4),(32,'2026-06-19','2026-06-20','2026-06-18 01:29:46.356000',7,'濡傚閰掑簵',115,NULL,'ysn',NULL,'13848965121',NULL,1,3,'鍙屼汉闂?,'寰呯‘璁?,NULL,NULL,NULL,4),(33,'2026-06-19','2026-06-20','2026-06-18 01:38:50.929000',8,'棣欐牸閲屾媺澶ч厭搴?,105,NULL,'ysn',NULL,'13598956238',NULL,1,4,'鍗曚汉闂?,'寰呯‘璁?,NULL,NULL,NULL,5),(34,'2026-06-21','2026-06-22','2026-06-18 01:51:39.234000',8,'棣欐牸閲屾媺澶ч厭搴?,105,NULL,'ysn',NULL,'13687456985',NULL,1,4,'鍗曚汉闂?,'宸茬‘璁?,NULL,'2026-06-18 01:52:07.778000',NULL,5),(35,'2026-06-20','2026-06-21','2026-06-18 01:57:35.950000',11,'璇鸿灏忛厭搴?,7799,NULL,'ysn',NULL,'13985412698',NULL,1,8,'鎬荤粺鎴?,'宸茬‘璁?,NULL,'2026-06-18 01:58:30.384000',NULL,6),(36,'2026-06-19','2026-06-20','2026-06-18 02:02:14.627000',10,'鐞惇澶ч厭搴?,9888,NULL,'caq',NULL,'13978946531',NULL,1,7,'鎬荤粺濂楁埧','宸茬‘璁?,NULL,'2026-06-18 02:02:56.161000',NULL,7),(37,'2026-06-17','2026-06-20','2026-06-18 03:03:22.942000',7,'濡傚閰掑簵',369,NULL,'ysn',NULL,'13948563415',NULL,1,1,'澶у簥鎴?,'寰呮敮浠?,NULL,NULL,NULL,4);
/*!40000 ALTER TABLE `hotelorder` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `message`
--

DROP TABLE IF EXISTS `message`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `message` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `order_id` bigint DEFAULT NULL,
  `hotel_id` bigint DEFAULT NULL,
  `merchant_id` varchar(50) DEFAULT NULL,
  `username` varchar(100) DEFAULT NULL,
  `content` text,
  `sender_role` varchar(20) DEFAULT NULL,
  `is_read` int DEFAULT '0',
  `create_time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `idx_username` (`username`),
  KEY `idx_merchant_id` (`merchant_id`)
) ENGINE=InnoDB AUTO_INCREMENT=142 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `message`
--

LOCK TABLES `message` WRITE;
/*!40000 ALTER TABLE `message` DISABLE KEYS */;
INSERT INTO `message` (`id`, `order_id`, `hotel_id`, `merchant_id`, `username`, `content`, `sender_role`, `is_read`, `create_time`) VALUES (1,14,7,'4','ysn','浣犲ソ','user',1,'2026-06-09 01:41:49'),(2,14,7,'4','ysn','鎮ㄥソ锛佽闂湁浠€涔堝彲浠ュ府鎮ㄧ殑锛熷緢楂樺叴涓烘偍鏈嶅姟锛?,'merchant',1,'2026-06-09 01:41:49'),(3,14,7,'4','ysn','鎴戝笇鏈涙崲鎴块棿','user',1,'2026-06-09 01:48:16'),(4,14,7,'4','ysn','鎰熻阿鎮ㄧ殑鐣欒█锛佸瀹堕厭搴椾細灏藉揩澶勭悊鎮ㄧ殑闂銆傜鎮ㄧ敓娲绘剦蹇紒','merchant',1,'2026-06-09 01:48:16'),(5,16,7,'4','rujia','浣犲ソ','user',1,'2026-06-09 02:11:39'),(6,16,7,'4','rujia','鎮ㄥソ锛佸瀹堕厭搴楀緢楂樺叴涓烘偍鏈嶅姟锛佽闂湁浠€涔堝彲浠ュ府鎮ㄧ殑锛?,'merchant',0,'2026-06-09 02:11:40'),(7,14,7,'4','ysn','浣犲ソ','user',1,'2026-06-09 02:18:49'),(8,14,7,'4','ysn','鎮ㄥソ锛佸瀹堕厭搴楀緢楂樺叴涓烘偍鏈嶅姟锛佽闂湁浠€涔堝彲浠ュ府鎮ㄧ殑锛?,'merchant',1,'2026-06-09 02:18:50'),(9,18,9,'6','caq','濂界殑锛岃阿璋?,'user',1,'2026-06-09 03:44:21'),(10,18,9,'6','caq','涓嶅姘旓紒璇鸿澶ч厭搴楃鎮ㄦ梾閫旀剦蹇紝鏈変换浣曢棶棰橀殢鏃惰仈绯绘垜浠紒馃槉','merchant',1,'2026-06-09 03:44:21'),(11,18,9,'6','caq','濂界殑锛屾敹鍒帮紒','merchant',1,'2026-06-09 03:44:55'),(12,20,8,'5','ysn','閰掑簵鍦板潃鍦ㄥ摢锛?,'user',1,'2026-06-12 01:02:40'),(13,20,8,'5','ysn','棣欐牸閲屾媺澶ч厭搴楃殑鍦板潃璇峰湪璁㈠崟璇︽儏涓煡鐪嬶紝鎮ㄤ篃鍙互鎵撳紑鍦板浘瀵艰埅銆?,'merchant',1,'2026-06-12 01:02:40'),(14,23,7,'4','ysn','123','merchant',1,'2026-06-14 06:46:16'),(15,23,7,'4','ysn','i浣犲ソ','merchant',1,'2026-06-14 06:46:23'),(16,23,7,'4','ysn','123','merchant',1,'2026-06-14 06:46:29'),(17,23,7,'4','ysn','濂界殑锛岃阿璋?,'user',1,'2026-06-15 02:44:22'),(18,23,7,'4','ysn','涓嶅姘旓紒濡傚閰掑簵绁濇偍鏃呴€旀剦蹇紝鏈変换浣曢棶棰橀殢鏃惰仈绯绘垜浠紒馃槉','merchant',1,'2026-06-15 02:44:22'),(19,25,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-15 03:17:16'),(20,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-15 03:17:16'),(21,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-15 03:17:16'),(22,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-15 03:17:16'),(23,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-15 03:17:16'),(24,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:17:36'),(25,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:17:36'),(26,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:17:36'),(27,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:17:36'),(28,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:17:36'),(29,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:17:36'),(30,27,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:18:52'),(31,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:18:52'),(32,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:18:52'),(33,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:18:52'),(34,27,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:18:52'),(35,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:18:52'),(36,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:18:52'),(37,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:18:52'),(38,27,11,'6','ysn','璇烽棶鏈変紭鎯犲悧锛?,'user',1,'2026-06-16 03:19:01'),(39,27,11,'6','ysn','鎰熻阿鎮ㄥ璇鸿灏忛厭搴楃殑鍏虫敞锛佹垜浠洰鍓嶆湁鏆戞湡鐗规儬娲诲姩锛岄儴鍒嗘埧鍨嬩綆鑷?鎶樸€?,'merchant',1,'2026-06-16 03:19:02'),(40,27,11,'6','ysn','璇烽棶鏈変紭鎯犲悧锛?,'user',1,'2026-06-16 03:19:02'),(41,27,11,'6','ysn','鎰熻阿鎮ㄥ璇鸿灏忛厭搴楃殑鍏虫敞锛佹垜浠洰鍓嶆湁鏆戞湡鐗规儬娲诲姩锛岄儴鍒嗘埧鍨嬩綆鑷?鎶樸€?,'merchant',1,'2026-06-16 03:19:02'),(42,18,9,'6','caq','绌烽','merchant',1,'2026-06-16 03:19:37'),(43,27,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:30:55'),(44,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:30:55'),(45,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:30:55'),(46,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:30:55'),(47,27,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:30:55'),(48,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:30:55'),(49,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:30:55'),(50,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:30:55'),(51,27,11,'6','ysn','鍟婂晩鍟?,'user',1,'2026-06-16 03:31:05'),(52,27,11,'6','ysn','鎰熻阿鎮ㄧ殑鐣欒█锛佽璇哄皬閰掑簵浼氬敖蹇鐞嗘偍鐨勯棶棰樸€傜鎮ㄧ敓娲绘剦蹇紒','merchant',1,'2026-06-16 03:31:06'),(53,27,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:33:49'),(54,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:33:49'),(55,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:33:49'),(56,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:33:49'),(57,27,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:33:49'),(58,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:33:49'),(59,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:33:49'),(60,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:33:49'),(61,27,11,'6','ysn','濂界殑锛岃阿璋?,'user',1,'2026-06-16 03:34:41'),(62,27,11,'6','ysn','涓嶅姘旓紒璇鸿灏忛厭搴楃鎮ㄦ梾閫旀剦蹇紝鏈変换浣曢棶棰橀殢鏃惰仈绯绘垜浠紒馃槉','merchant',1,'2026-06-16 03:34:42'),(63,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:47:08'),(64,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:47:08'),(65,27,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:47:08'),(66,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:47:08'),(67,27,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:47:08'),(68,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:47:08'),(69,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:47:08'),(70,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-16 03:47:08'),(71,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:38:49'),(72,27,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:38:49'),(73,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:38:49'),(74,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:38:49'),(75,27,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:38:49'),(76,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:38:49'),(77,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:38:49'),(78,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:38:49'),(79,27,11,'6','ysn','濂界殑锛岃阿璋?,'user',1,'2026-06-18 00:39:10'),(80,27,11,'6','ysn','涓嶅姘旓紒璇鸿灏忛厭搴楃鎮ㄦ梾閫旀剦蹇紝鏈変换浣曢棶棰橀殢鏃惰仈绯绘垜浠紒馃槉','merchant',1,'2026-06-18 00:39:11'),(81,27,11,'6','ysn','濂界殑锛岃阿璋?,'user',1,'2026-06-18 00:39:11'),(82,27,11,'6','ysn','涓嶅姘旓紒璇鸿灏忛厭搴楃鎮ㄦ梾閫旀剦蹇紝鏈変换浣曢棶棰橀殢鏃惰仈绯绘垜浠紒馃槉','merchant',1,'2026-06-18 00:39:12'),(83,27,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:40:40'),(84,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:40:40'),(85,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:40:40'),(86,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:40:40'),(87,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:40:40'),(88,27,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:40:40'),(89,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:40:40'),(90,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:40:40'),(91,28,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-19\n馃搮 閫€鎴挎棩鏈燂細2026-06-20\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:45:41'),(92,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:47:11'),(93,28,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-19\n馃搮 閫€鎴挎棩鏈燂細2026-06-20\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:47:11'),(94,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:47:11'),(95,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:47:11'),(96,28,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-19\n馃搮 閫€鎴挎棩鏈燂細2026-06-20\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:47:11'),(97,26,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-17\n馃搮 閫€鎴挎棩鏈燂細2026-06-18\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:47:11'),(98,22,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-12\n馃搮 閫€鎴挎棩鏈燂細2026-06-13\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:47:11'),(99,24,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?23\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛佺鎮ㄥ叆浣忔剦蹇紒','merchant',1,'2026-06-18 00:47:11'),(100,29,11,'6','ysn','濂界殑锛屾敹鍒帮紒','merchant',1,'2026-06-18 00:54:35'),(129,22,8,'5','ysn','濂界殑锛岃阿璋?,'user',1,'2026-06-18 01:38:33'),(130,22,8,'5','ysn','涓嶅姘旓紒棣欐牸閲屾媺澶ч厭搴楃鎮ㄦ梾閫旀剦蹇紝鏈変换浣曢棶棰橀殢鏃惰仈绯绘垜浠紒馃槉','merchant',1,'2026-06-18 01:38:33'),(131,33,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-19\n馃搮 閫€鎴挎棩鏈燂細2026-06-20\n馃挵 璁㈠崟閲戦锛毬?05\n\n鎮ㄥ凡鏀粯鎴愬姛锛岀瓑寰呭晢瀹剁‘璁わ紝濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛?,'merchant',1,'2026-06-18 01:39:04'),(132,34,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-21\n馃搮 閫€鎴挎棩鏈燂細2026-06-22\n馃挵 璁㈠崟閲戦锛毬?05\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛屾杩庢偍鐨勫叆浣弤','merchant',1,'2026-06-18 01:52:08'),(133,32,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-19\n馃搮 閫€鎴挎棩鏈燂細2026-06-20\n馃挵 璁㈠崟閲戦锛毬?15\n\n鎮ㄥ凡鏀粯鎴愬姛锛岀瓑寰呭晢瀹剁‘璁わ紝濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛?,'merchant',1,'2026-06-18 01:52:38'),(134,25,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?888\n\n鎮ㄥ凡鏀粯鎴愬姛锛岀瓑寰呭晢瀹剁‘璁わ紝濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛?,'merchant',1,'2026-06-18 01:52:38'),(135,33,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-19\n馃搮 閫€鎴挎棩鏈燂細2026-06-20\n馃挵 璁㈠崟閲戦锛毬?05\n\n鎮ㄥ凡鏀粯鎴愬姛锛岀瓑寰呭晢瀹剁‘璁わ紝濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛?,'merchant',1,'2026-06-18 01:52:38'),(136,33,8,'5','ysn','馃帀 娆㈣繋棰勮棣欐牸閲屾媺澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-19\n馃搮 閫€鎴挎棩鏈燂細2026-06-20\n馃挵 璁㈠崟閲戦锛毬?05\n\n鎮ㄥ凡鏀粯鎴愬姛锛岀瓑寰呭晢瀹剁‘璁わ紝濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛?,'merchant',1,'2026-06-18 01:52:38'),(137,32,7,'4','ysn','馃帀 娆㈣繋棰勮濡傚閰掑簵锛乗n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-19\n馃搮 閫€鎴挎棩鏈燂細2026-06-20\n馃挵 璁㈠崟閲戦锛毬?15\n\n鎮ㄥ凡鏀粯鎴愬姛锛岀瓑寰呭晢瀹剁‘璁わ紝濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛?,'merchant',1,'2026-06-18 01:52:38'),(138,25,10,'7','ysn','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-16\n馃搮 閫€鎴挎棩鏈燂細2026-06-17\n馃挵 璁㈠崟閲戦锛毬?888\n\n鎮ㄥ凡鏀粯鎴愬姛锛岀瓑寰呭晢瀹剁‘璁わ紝濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛?,'merchant',1,'2026-06-18 01:52:38'),(139,35,11,'6','ysn','馃帀 娆㈣繋棰勮璇鸿灏忛厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-20\n馃搮 閫€鎴挎棩鏈燂細2026-06-21\n馃挵 璁㈠崟閲戦锛毬?799\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛屾杩庢偍鐨勫叆浣弤','merchant',1,'2026-06-18 01:58:30'),(140,36,10,'7','caq','馃帀 娆㈣繋棰勮鐞惇澶ч厭搴楋紒\n\n馃搮 鍏ヤ綇鏃ユ湡锛?026-06-19\n馃搮 閫€鎴挎棩鏈燂細2026-06-20\n馃挵 璁㈠崟閲戦锛毬?888\n\n濡傛湁浠讳綍闂锛岃闅忔椂鑱旂郴鎴戜滑锛屾杩庢偍鐨勫叆浣弤','merchant',1,'2026-06-18 02:02:56'),(141,16,7,'4','rujia','濂界殑锛屾敹鍒帮紒','merchant',0,'2026-06-18 02:32:16');
/*!40000 ALTER TABLE `message` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `notification`
--

DROP TABLE IF EXISTS `notification`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `notification` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `merchant_id` bigint NOT NULL,
  `merchant_name` varchar(100) DEFAULT NULL,
  `type` varchar(50) DEFAULT NULL,
  `title` varchar(200) DEFAULT NULL,
  `content` text,
  `related_id` varchar(50) DEFAULT NULL,
  `related_name` varchar(100) DEFAULT NULL,
  `status` varchar(20) DEFAULT 'UNREAD',
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `reply` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=46 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `notification`
--

LOCK TABLES `notification` WRITE;
/*!40000 ALTER TABLE `notification` DISABLE KEYS */;
INSERT INTO `notification` (`id`, `merchant_id`, `merchant_name`, `type`, `title`, `content`, `related_id`, `related_name`, `status`, `create_time`, `reply`) VALUES (1,4,'濡傚閰掑簵','HOTEL_BANNED','閰掑簵宸茶绂佺敤','鎮ㄧ殑閰掑簵銆屽瀹堕厭搴椼€嶅凡琚鐞嗗憳绂佺敤锛屽師鍥狅細杩濊缁忚惀銆傝鍙婃椂澶勭悊銆?,'7','濡傚閰掑簵','READ','2026-06-13 06:33:34',NULL),(2,4,'濡傚閰掑簵','HOTEL_UNBANNED','閰掑簵宸叉仮澶?,'鎮ㄧ殑閰掑簵銆屽瀹堕厭搴椼€嶅凡鎭㈠姝ｅ父钀ヤ笟銆?,'7','濡傚閰掑簵','READ','2026-06-13 06:50:13',NULL),(3,4,'濡傚閰掑簵','HOTEL_BANNED','閰掑簵宸茶绂佺敤','鎮ㄧ殑閰掑簵銆屽瀹堕厭搴椼€嶅凡琚鐞嗗憳绂佺敤锛屽師鍥狅細杩濊缁忚惀銆傝鍙婃椂澶勭悊銆?,'7','濡傚閰掑簵','READ','2026-06-13 06:50:22',NULL),(4,4,'濡傚閰掑簵','APPEAL_REPLY','鐢宠瘔宸查€氳繃','鎮ㄧ殑鐢宠瘔宸查€氳繃瀹℃牳锛岃处鍙峰凡鎭㈠姝ｅ父銆?,'4','濡傚閰掑簵','READ','2026-06-13 06:51:19','鏀跺埌'),(5,4,'濡傚閰掑簵','HOTEL_UNBANNED','閰掑簵宸叉仮澶?,'鎮ㄧ殑閰掑簵銆屽瀹堕厭搴椼€嶅凡鎭㈠姝ｅ父钀ヤ笟銆?,'7','濡傚閰掑簵','READ','2026-06-13 06:51:32',NULL),(6,1,'ysn','USER_UNBANNED','璐﹀彿宸茶В绂?,'鎮ㄧ殑璐﹀彿宸叉仮澶嶆甯革紝鍙互缁х画鍙戝竷璇勮鍜岃瘎浠蜂簡銆?,'1','ysn','READ','2026-06-13 07:17:18',NULL),(7,1,'ysn','USER_BANNED','璐﹀彿宸茶绂佽█','鎮ㄧ殑璐﹀彿宸茶绠＄悊鍛樼瑷€锛屽師鍥狅細杩濊瑷€璁恒€傜瑷€鏈熼棿鏃犳硶鍙戝竷璇勮鍜岃瘎浠枫€?,'1','ysn','READ','2026-06-13 07:17:33',NULL),(8,1,'ysn','USER_UNBANNED','璐﹀彿宸茶В绂?,'鎮ㄧ殑璐﹀彿宸叉仮澶嶆甯革紝鍙互缁х画鍙戝竷璇勮鍜岃瘎浠蜂簡銆?,'1','ysn','READ','2026-06-13 07:17:58',NULL),(9,1,'ysn','USER_BANNED','璐﹀彿宸茶绂佽█','鎮ㄧ殑璐﹀彿宸茶绠＄悊鍛樼瑷€锛屽師鍥狅細杩濊瑷€璁恒€傜瑷€鏈熼棿鏃犳硶鍙戝竷璇勮鍜岃瘎浠枫€?,'1','ysn','READ','2026-06-13 07:18:09',NULL),(10,1,'ysn','USER_UNBANNED','璐﹀彿宸茶В绂?,'鎮ㄧ殑璐﹀彿宸叉仮澶嶆甯革紝鍙互缁х画鍙戝竷璇勮鍜岃瘎浠蜂簡銆?,'1','ysn','READ','2026-06-13 07:25:02',NULL),(11,1,'ysn','USER_UNBANNED','璐﹀彿宸茶В绂?,'鎮ㄧ殑璐﹀彿宸叉仮澶嶆甯革紝鍙互缁х画鍙戝竷璇勮鍜岃瘎浠蜂簡銆?,'1','ysn','READ','2026-06-13 07:25:02',NULL),(12,1,'ysn','USER_BANNED','璐﹀彿宸茶绂佽█','鎮ㄧ殑璐﹀彿宸茶绠＄悊鍛樼瑷€1澶╋紝鍘熷洜锛氳繚瑙勩€傜瑷€鏈熼棿鏃犳硶鍙戝竷璇勮鍜岃瘎浠枫€?,'1','ysn','READ','2026-06-13 07:25:12',NULL),(13,6,'璇鸿澶ч厭搴?,'HOTEL_BANNED','閰掑簵宸茶绂佺敤','鎮ㄧ殑閰掑簵銆岃璇哄ぇ閰掑簵銆嶅凡琚鐞嗗憳绂佺敤锛屽師鍥狅細鑹叉儏浣庝織銆傝鍙婃椂澶勭悊銆?,'9','璇鸿澶ч厭搴?,'READ','2026-06-14 06:30:59',NULL),(14,1,'ysn','USER_UNBANNED','璐﹀彿宸茶В绂?,'鎮ㄧ殑璐﹀彿宸叉仮澶嶆甯革紝鍙互缁х画鍙戝竷璇勮鍜岃瘎浠蜂簡銆?,'1','ysn','READ','2026-06-14 06:32:39',NULL),(15,1,'ysn','USER_UNBANNED','璐﹀彿宸茶В绂?,'鎮ㄧ殑璐﹀彿宸叉仮澶嶆甯革紝鍙互缁х画鍙戝竷璇勮鍜岃瘎浠蜂簡銆?,'1','ysn','READ','2026-06-14 06:32:39',NULL),(16,4,'濡傚澶ч厭搴?,'MERCHANT_BANNED','璐﹀彿宸茶绂佺敤','鎮ㄧ殑鍟嗗璐﹀彿宸茶绠＄悊鍛樼鐢紝鍘熷洜锛氳繚瑙勭粡钀ャ€傚鏈夌枒闂紝璇烽€氳繃鐢宠瘔鍔熻兘鑱旂郴绠＄悊鍛樸€?,'4','濡傚澶ч厭搴?,'READ','2026-06-14 06:32:48',NULL),(17,4,'濡傚澶ч厭搴?,'APPEAL_REPLY','鐢宠瘔鏈€氳繃','鎮ㄧ殑鐢宠瘔鏈閫氳繃銆?,'4','濡傚澶ч厭搴?,'READ','2026-06-14 06:42:15','gun'),(18,4,'濡傚澶ч厭搴?,'MERCHANT_UNBANNED','璐﹀彿宸叉仮澶?,'鎮ㄧ殑鍟嗗璐﹀彿宸叉仮澶嶆甯镐娇鐢紝鎰熻阿鎮ㄧ殑閰嶅悎銆?,'4','濡傚澶ч厭搴?,'READ','2026-06-14 06:45:10',NULL),(19,6,'璇鸿澶ч厭搴?,'HOTEL_UNBANNED','閰掑簵宸叉仮澶?,'鎮ㄧ殑閰掑簵銆岃璇哄ぇ閰掑簵銆嶅凡鎭㈠姝ｅ父钀ヤ笟銆?,'9','璇鸿澶ч厭搴?,'READ','2026-06-14 08:30:43',NULL),(20,7,'鐞惇澶ч厭搴?,'MERCHANT_BANNED','璐﹀彿宸茶绂佺敤','鎮ㄧ殑鍟嗗璐﹀彿宸茶绠＄悊鍛樼鐢紝鍘熷洜锛氳繚瑙勭粡钀ャ€傚鏈夌枒闂紝璇烽€氳繃鐢宠瘔鍔熻兘鑱旂郴绠＄悊鍛樸€?,'7','鐞惇澶ч厭搴?,'READ','2026-06-16 01:04:41',NULL),(21,7,'鐞惇澶ч厭搴?,'APPEAL_REPLY','鐢宠瘔宸查€氳繃','鎮ㄧ殑鐢宠瘔宸查€氳繃瀹℃牳锛岃处鍙峰凡鎭㈠姝ｅ父銆?,'7','鐞惇澶ч厭搴?,'READ','2026-06-16 01:07:07','ok'),(22,7,'鐞惇澶ч厭搴?,'MERCHANT_BANNED','璐﹀彿宸茶绂佺敤','鎮ㄧ殑鍟嗗璐﹀彿宸茶绠＄悊鍛樼鐢紝鍘熷洜锛氳繚瑙勭粡钀ャ€傚鏈夌枒闂紝璇烽€氳繃鐢宠瘔鍔熻兘鑱旂郴绠＄悊鍛樸€?,'7','鐞惇澶ч厭搴?,'READ','2026-06-16 01:08:58',NULL),(23,7,'鐞惇澶ч厭搴?,'MERCHANT_UNBANNED','璐﹀彿宸叉仮澶?,'鎮ㄧ殑鍟嗗璐﹀彿宸叉仮澶嶆甯镐娇鐢紝鎰熻阿鎮ㄧ殑閰嶅悎銆?,'7','鐞惇澶ч厭搴?,'READ','2026-06-16 01:09:03',NULL),(24,7,'鐞惇澶ч厭搴?,'MERCHANT_BANNED','璐﹀彿宸茶绂佺敤','鎮ㄧ殑鍟嗗璐﹀彿宸茶绠＄悊鍛樼鐢紝鍘熷洜锛氳繚瑙勭粡钀ャ€傚鏈夌枒闂紝璇烽€氳繃鐢宠瘔鍔熻兘鑱旂郴绠＄悊鍛樸€?,'7','鐞惇澶ч厭搴?,'READ','2026-06-16 01:09:14',NULL),(25,7,'鐞惇澶ч厭搴?,'HOTEL_UNBANNED','閰掑簵宸叉仮澶?,'鎮ㄧ殑閰掑簵銆岀惇鐞ぇ閰掑簵銆嶅凡鎭㈠姝ｅ父钀ヤ笟銆?,'10','鐞惇澶ч厭搴?,'READ','2026-06-16 01:09:29',NULL),(26,7,'鐞惇澶ч厭搴?,'MERCHANT_UNBANNED','璐﹀彿宸叉仮澶?,'鎮ㄧ殑鍟嗗璐﹀彿宸叉仮澶嶆甯镐娇鐢紝鎰熻阿鎮ㄧ殑閰嶅悎銆?,'7','鐞惇澶ч厭搴?,'READ','2026-06-16 01:09:38',NULL),(27,7,'鐞惇澶ч厭搴?,'MERCHANT_BANNED','璐﹀彿宸茶绂佺敤','鎮ㄧ殑鍟嗗璐﹀彿宸茶绠＄悊鍛樼鐢紝鍘熷洜锛氳繚瑙勭粡钀ャ€傚鏈夌枒闂紝璇烽€氳繃鐢宠瘔鍔熻兘鑱旂郴绠＄悊鍛樸€?,'7','鐞惇澶ч厭搴?,'READ','2026-06-16 01:09:41',NULL),(28,7,'鐞惇澶ч厭搴?,'MERCHANT_UNBANNED','璐﹀彿宸叉仮澶?,'鎮ㄧ殑鍟嗗璐﹀彿宸叉仮澶嶆甯镐娇鐢紝鎰熻阿鎮ㄧ殑閰嶅悎銆?,'7','鐞惇澶ч厭搴?,'READ','2026-06-16 01:09:50',NULL),(29,7,'鐞惇澶ч厭搴?,'MERCHANT_BANNED','璐﹀彿宸茶绂佺敤','鎮ㄧ殑鍟嗗璐﹀彿宸茶绠＄悊鍛樼鐢紝鍘熷洜锛氳繚瑙勭粡钀ャ€傚鏈夌枒闂紝璇烽€氳繃鐢宠瘔鍔熻兘鑱旂郴绠＄悊鍛樸€?,'7','鐞惇澶ч厭搴?,'UNREAD','2026-06-16 01:15:29',NULL),(30,7,'鐞惇澶ч厭搴?,'MERCHANT_UNBANNED','璐﹀彿宸叉仮澶?,'鎮ㄧ殑鍟嗗璐﹀彿宸叉仮澶嶆甯镐娇鐢紝鎰熻阿鎮ㄧ殑閰嶅悎銆?,'7','鐞惇澶ч厭搴?,'UNREAD','2026-06-16 01:32:03',NULL),(31,7,'鐞惇澶ч厭搴?,'MERCHANT_BANNED','璐﹀彿宸茶绂佺敤','鎮ㄧ殑鍟嗗璐﹀彿宸茶绠＄悊鍛樼鐢紝鍘熷洜锛氳繚瑙勭粡钀ャ€傚鏈夌枒闂紝璇烽€氳繃鐢宠瘔鍔熻兘鑱旂郴绠＄悊鍛樸€?,'7','鐞惇澶ч厭搴?,'UNREAD','2026-06-16 01:32:12',NULL),(32,7,'鐞惇澶ч厭搴?,'MERCHANT_UNBANNED','璐﹀彿宸叉仮澶?,'鎮ㄧ殑鍟嗗璐﹀彿宸叉仮澶嶆甯镐娇鐢紝鎰熻阿鎮ㄧ殑閰嶅悎銆?,'7','鐞惇澶ч厭搴?,'UNREAD','2026-06-16 01:44:58',NULL),(33,7,'鐞惇澶ч厭搴?,'MERCHANT_BANNED','璐﹀彿宸茶绂佺敤','鎮ㄧ殑鍟嗗璐﹀彿宸茶绠＄悊鍛樼鐢紝鍘熷洜锛氳繚瑙勭粡钀ャ€傚鏈夌枒闂紝璇烽€氳繃鐢宠瘔鍔熻兘鑱旂郴绠＄悊鍛樸€?,'7','鐞惇澶ч厭搴?,'UNREAD','2026-06-16 01:53:00',NULL),(34,7,'鐞惇澶ч厭搴?,'MERCHANT_UNBANNED','璐﹀彿宸叉仮澶?,'鎮ㄧ殑鍟嗗璐﹀彿宸叉仮澶嶆甯镐娇鐢紝鎰熻阿鎮ㄧ殑閰嶅悎銆?,'7','鐞惇澶ч厭搴?,'UNREAD','2026-06-16 01:53:41',NULL),(35,7,'鐞惇澶ч厭搴?,'MERCHANT_BANNED','璐﹀彿宸茶绂佺敤','鎮ㄧ殑鍟嗗璐﹀彿宸茶绠＄悊鍛樼鐢紝鍘熷洜锛氳繚瑙勭粡钀ャ€傚鏈夌枒闂紝璇烽€氳繃鐢宠瘔鍔熻兘鑱旂郴绠＄悊鍛樸€?,'7','鐞惇澶ч厭搴?,'UNREAD','2026-06-16 01:58:07',NULL),(36,7,'鐞惇澶ч厭搴?,'APPEAL_REPLY','鐢宠瘔宸查€氳繃','鎮ㄧ殑鐢宠瘔宸查€氳繃瀹℃牳锛岃处鍙峰凡鎭㈠姝ｅ父銆?,'7','鐞惇澶ч厭搴?,'UNREAD','2026-06-16 02:02:04','濂界殑'),(37,4,'濡傚澶ч厭搴?,'MERCHANT_BANNED','璐﹀彿宸茶绂佺敤','鎮ㄧ殑鍟嗗璐﹀彿宸茶绠＄悊鍛樼鐢紝鍘熷洜锛氳繚瑙勭粡钀ャ€傚鏈夌枒闂紝璇烽€氳繃鐢宠瘔鍔熻兘鑱旂郴绠＄悊鍛樸€?,'4','濡傚澶ч厭搴?,'READ','2026-06-16 02:13:44',NULL),(38,4,'濡傚澶ч厭搴?,'MERCHANT_UNBANNED','璐﹀彿宸叉仮澶?,'鎮ㄧ殑鍟嗗璐﹀彿宸叉仮澶嶆甯镐娇鐢紝鎰熻阿鎮ㄧ殑閰嶅悎銆?,'4','濡傚澶ч厭搴?,'READ','2026-06-16 02:13:48',NULL),(39,7,'鐞惇澶ч厭搴?,'MERCHANT_BANNED','璐﹀彿宸茶绂佺敤','鎮ㄧ殑鍟嗗璐﹀彿宸茶绠＄悊鍛樼鐢紝鍘熷洜锛氳繚瑙勭粡钀ャ€傚鏈夌枒闂紝璇烽€氳繃鐢宠瘔鍔熻兘鑱旂郴绠＄悊鍛樸€?,'7','鐞惇澶ч厭搴?,'UNREAD','2026-06-16 02:13:51',NULL),(40,7,'鐞惇澶ч厭搴?,'MERCHANT_UNBANNED','璐﹀彿宸叉仮澶?,'鎮ㄧ殑鍟嗗璐﹀彿宸叉仮澶嶆甯镐娇鐢紝鎰熻阿鎮ㄧ殑閰嶅悎銆?,'7','鐞惇澶ч厭搴?,'UNREAD','2026-06-16 02:25:42',NULL),(41,7,'鐞惇澶ч厭搴?,'MERCHANT_BANNED','璐﹀彿宸茶绂佺敤','鎮ㄧ殑鍟嗗璐﹀彿宸茶绠＄悊鍛樼鐢紝鍘熷洜锛氳繚瑙勭粡钀ャ€傚鏈夌枒闂紝璇烽€氳繃鐢宠瘔鍔熻兘鑱旂郴绠＄悊鍛樸€?,'7','鐞惇澶ч厭搴?,'UNREAD','2026-06-16 02:25:52',NULL),(42,7,'鐞惇澶ч厭搴?,'MERCHANT_UNBANNED','璐﹀彿宸叉仮澶?,'鎮ㄧ殑鍟嗗璐﹀彿宸叉仮澶嶆甯镐娇鐢紝鎰熻阿鎮ㄧ殑閰嶅悎銆?,'7','鐞惇澶ч厭搴?,'UNREAD','2026-06-16 02:42:45',NULL),(43,7,'鐞惇澶ч厭搴?,'APPEAL_REPLY','鐢宠瘔宸查€氳繃','鎮ㄧ殑鐢宠瘔宸查€氳繃瀹℃牳锛岃处鍙峰凡鎭㈠姝ｅ父銆?,'7','鐞惇澶ч厭搴?,'UNREAD','2026-06-18 03:15:14','ok'),(44,4,'濡傚澶ч厭搴?,'HOTEL_BANNED','閰掑簵宸茶绂佺敤','鎮ㄧ殑閰掑簵銆屽瀹堕厭搴椼€嶅凡琚鐞嗗憳绂佺敤锛屽師鍥狅細杩濊缁忚惀銆傝鍙婃椂澶勭悊銆?,'7','濡傚閰掑簵','UNREAD','2026-06-18 03:57:45',NULL),(45,4,'濡傚澶ч厭搴?,'HOTEL_UNBANNED','閰掑簵宸叉仮澶?,'鎮ㄧ殑閰掑簵銆屽瀹堕厭搴椼€嶅凡鎭㈠姝ｅ父钀ヤ笟銆?,'7','濡傚閰掑簵','UNREAD','2026-06-18 03:57:57',NULL);
/*!40000 ALTER TABLE `notification` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `order_items`
--

DROP TABLE IF EXISTS `order_items`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `order_items` (
  `id` int NOT NULL AUTO_INCREMENT,
  `order_id` int NOT NULL,
  `product_id` int NOT NULL,
  `name` varchar(255) NOT NULL,
  `price` decimal(10,2) NOT NULL,
  `quantity` int NOT NULL,
  PRIMARY KEY (`id`),
  KEY `order_id` (`order_id`),
  CONSTRAINT `order_items_ibfk_1` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `order_items`
--

LOCK TABLES `order_items` WRITE;
/*!40000 ALTER TABLE `order_items` DISABLE KEYS */;
INSERT INTO `order_items` (`id`, `order_id`, `product_id`, `name`, `price`, `quantity`) VALUES (1,1,1,'蹇',36.40,1);
/*!40000 ALTER TABLE `order_items` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `orders`
--

DROP TABLE IF EXISTS `orders`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `orders` (
  `id` int NOT NULL AUTO_INCREMENT,
  `total_price` decimal(10,2) NOT NULL,
  `total_quantity` int NOT NULL,
  `order_date` datetime NOT NULL,
  `check_in` varchar(255) DEFAULT NULL,
  `check_out` varchar(255) DEFAULT NULL,
  `create_time` datetime(6) DEFAULT NULL,
  `hotel_id` bigint DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `price` double DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `orders`
--

LOCK TABLES `orders` WRITE;
/*!40000 ALTER TABLE `orders` DISABLE KEYS */;
INSERT INTO `orders` (`id`, `total_price`, `total_quantity`, `order_date`, `check_in`, `check_out`, `create_time`, `hotel_id`, `name`, `price`, `type`) VALUES (1,36.40,1,'2026-05-11 08:27:22',NULL,NULL,NULL,NULL,NULL,NULL,NULL),(2,0.00,0,'2026-05-22 02:14:20',NULL,NULL,NULL,NULL,NULL,NULL,NULL);
/*!40000 ALTER TABLE `orders` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `room_type`
--

DROP TABLE IF EXISTS `room_type`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `room_type` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `available_count` int DEFAULT NULL,
  `bed_type` varchar(255) DEFAULT NULL,
  `breakfast` varchar(255) DEFAULT NULL,
  `price` double DEFAULT NULL,
  `size` varchar(255) DEFAULT NULL,
  `total_count` int DEFAULT NULL,
  `type_name` varchar(255) DEFAULT NULL,
  `window_status` varchar(255) DEFAULT NULL,
  `hotel_id` bigint DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FK8sgnny12n0v74j6u7u94w7mxp` (`hotel_id`),
  CONSTRAINT `FK8sgnny12n0v74j6u7u94w7mxp` FOREIGN KEY (`hotel_id`) REFERENCES `hotel` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `room_type`
--

LOCK TABLES `room_type` WRITE;
/*!40000 ALTER TABLE `room_type` DISABLE KEYS */;
INSERT INTO `room_type` (`id`, `available_count`, `bed_type`, `breakfast`, `price`, `size`, `total_count`, `type_name`, `window_status`, `hotel_id`) VALUES (1,2,'澶у簥','鍚棭',123,'50銕?,10,'澶у簥鎴?,'鏈夌獥',7),(2,1,'鍙屽簥','鍚棭',8999,'200',2,'鎬荤粺鎴?,'鏃犵獥',9),(3,7,'鍙屽簥','涓嶅惈鏃?,115,'40銕?,10,'鍙屼汉闂?,'鏈夌獥',7),(4,17,'鍗曚汉搴?,'鍚棭',105,'23銕?,20,'鍗曚汉闂?,'鏈夌獥',8),(5,9,'鍙屽簥','涓嶅惈鏃?,125,'40銕?,10,'鍙屼汉闂?,'鏈夌獥',8),(6,10,'澶у簥','涓嶅惈鏃?,120,'35銕?,10,'澶у簥鎴?,'鏈夌獥',8),(7,3,'澶у簥','鍚棭',9888,'100銕?,6,'鎬荤粺濂楁埧','鏈夌獥',10),(8,2,'鍙屽簥','鍚棭',7799,'2778',5,'鎬荤粺鎴?,'鏈夌獥',11),(9,10,'澶у簥','涓嶅惈鏃?,199,'88骞崇背',10,'澶у簥鎴?,'鏈夌獥',12),(10,5,'鍗曚汉搴?,'涓嶅惈鏃?,159,'35骞崇背',5,'鍗曚汉闂?,'鏃犵獥',12);
/*!40000 ALTER TABLE `room_type` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `route_scenic`
--

DROP TABLE IF EXISTS `route_scenic`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `route_scenic` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `route_id` bigint NOT NULL,
  `scenic_id` bigint NOT NULL,
  `day_number` int DEFAULT NULL,
  `sort_order` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `route_id` (`route_id`),
  KEY `scenic_id` (`scenic_id`),
  CONSTRAINT `route_scenic_ibfk_1` FOREIGN KEY (`route_id`) REFERENCES `tour_route` (`id`),
  CONSTRAINT `route_scenic_ibfk_2` FOREIGN KEY (`scenic_id`) REFERENCES `scenic` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `route_scenic`
--

LOCK TABLES `route_scenic` WRITE;
/*!40000 ALTER TABLE `route_scenic` DISABLE KEYS */;
/*!40000 ALTER TABLE `route_scenic` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `scenic`
--

DROP TABLE IF EXISTS `scenic`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `scenic` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `province` varchar(255) DEFAULT NULL,
  `photo` varchar(255) DEFAULT NULL,
  `description` text,
  `score` double DEFAULT NULL,
  `ticket_price` decimal(10,2) DEFAULT NULL,
  `audit_status` int DEFAULT NULL,
  `create_time` datetime DEFAULT NULL,
  `update_time` datetime DEFAULT NULL,
  `city` varchar(255) DEFAULT NULL,
  `level` varchar(255) DEFAULT NULL,
  `open_time` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `scenic`
--

LOCK TABLES `scenic` WRITE;
/*!40000 ALTER TABLE `scenic` DISABLE KEYS */;
/*!40000 ALTER TABLE `scenic` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `score`
--

DROP TABLE IF EXISTS `score`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `score` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `attraction_id` bigint DEFAULT NULL,
  `score` int DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=24 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `score`
--

LOCK TABLES `score` WRITE;
/*!40000 ALTER TABLE `score` DISABLE KEYS */;
INSERT INTO `score` (`id`, `attraction_id`, `score`) VALUES (1,1,1),(2,1,1),(3,1,5),(4,1,5),(5,1,5),(6,1,5),(7,1,5),(8,1,5),(9,1,5),(10,1,5),(11,1,5),(12,1,5),(13,1,5),(14,1,5),(15,1,5),(16,1,5),(17,1,5),(18,1,5),(19,1,5),(20,1,5),(21,1,5),(22,1,5),(23,1,5);
/*!40000 ALTER TABLE `score` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `system_notice`
--

DROP TABLE IF EXISTS `system_notice`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `system_notice` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `username` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '鎺ユ敹閫氱煡鐨勭敤鎴峰悕',
  `type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '閫氱煡绫诲瀷锛欻OTEL_ORDER, FLIGHT_ORDER',
  `order_id` bigint NOT NULL COMMENT '鍏宠仈鐨勮鍗旾D',
  `title` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '閫氱煡鏍囬',
  `content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '閫氱煡鍐呭',
  `emoji` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT '?' COMMENT '鍥炬爣emoji',
  `is_read` tinyint DEFAULT '0' COMMENT '鏄惁宸茶',
  `create_time` datetime NOT NULL COMMENT '鍒涘缓鏃堕棿',
  PRIMARY KEY (`id`),
  KEY `idx_username` (`username`),
  KEY `idx_order_type` (`order_id`,`type`),
  KEY `idx_create_time` (`create_time`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='绯荤粺閫氱煡琛?;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `system_notice`
--

LOCK TABLES `system_notice` WRITE;
/*!40000 ALTER TABLE `system_notice` DISABLE KEYS */;
INSERT INTO `system_notice` (`id`, `username`, `type`, `order_id`, `title`, `content`, `emoji`, `is_read`, `create_time`) VALUES (1,'ysn','HOTEL_ORDER',24,'閰掑簵棰勮鎴愬姛','鎮ㄩ璁㈢殑濡傚閰掑簵宸茬‘璁わ紒鍏ヤ綇鏃ユ湡锛?026-06-16锛岄€€鎴挎棩鏈燂細2026-06-17锛岄噾棰濓細楼123.00銆傜鎮ㄥ叆浣忔剦蹇紒','馃彣',1,'2026-06-15 02:36:54'),(2,'ysn','FLIGHT_ORDER',12,'鏈虹エ璁㈣喘鎴愬姛','鎮ㄩ璁㈢殑鍖椾含棣栭兘 鈫?涓婃捣铏规ˉ鏈虹エ宸插嚭绁ㄦ垚鍔燂紒鑸彮鍙凤細CA1234锛岃捣椋炴椂闂达細2026-06-22 08:00锛岄噾棰濓細楼850.00銆傝鎻愬墠2灏忔椂鍒拌揪鏈哄満锛?,'鉁堬笍',1,'2026-06-15 02:42:51'),(3,'ysn','HOTEL_ORDER',25,'閰掑簵棰勮鎴愬姛','鎮ㄩ璁㈢殑鐞惇澶ч厭搴楀凡纭锛佸叆浣忔棩鏈燂細2026-06-16锛岄€€鎴挎棩鏈燂細2026-06-17锛岄噾棰濓細楼9888.00銆傜鎮ㄥ叆浣忔剦蹇紒','馃彣',1,'2026-06-15 02:49:55'),(4,'ysn','HOTEL_ORDER',27,'閰掑簵棰勮鎴愬姛','鎮ㄩ璁㈢殑璇鸿灏忛厭搴楀凡纭锛佸叆浣忔棩鏈燂細2026-06-17锛岄€€鎴挎棩鏈燂細2026-06-18锛岄噾棰濓細楼7799.00銆傜鎮ㄥ叆浣忔剦蹇紒','馃彣',1,'2026-06-16 03:18:04'),(5,'ysn','HOTEL_ORDER',28,'閰掑簵棰勮鎴愬姛','鎮ㄩ璁㈢殑璇鸿灏忛厭搴楀凡纭锛佸叆浣忔棩鏈燂細2026-06-19锛岄€€鎴挎棩鏈燂細2026-06-20锛岄噾棰濓細楼7799.00銆傜鎮ㄥ叆浣忔剦蹇紒','馃彣',1,'2026-06-18 00:46:14'),(6,'ysn','HOTEL_ORDER',29,'閰掑簵棰勮鎴愬姛','鎮ㄩ璁㈢殑璇鸿灏忛厭搴楀凡纭锛佸叆浣忔棩鏈燂細2026-06-19锛岄€€鎴挎棩鏈燂細2026-06-20锛岄噾棰濓細楼7799.00銆傜鎮ㄥ叆浣忔剦蹇紒','馃彣',1,'2026-06-18 00:50:31'),(7,'ysn','HOTEL_ORDER',30,'閰掑簵棰勮鎴愬姛','鎮ㄩ璁㈢殑璇鸿灏忛厭搴楀凡纭锛佸叆浣忔棩鏈燂細2026-06-19锛岄€€鎴挎棩鏈燂細2026-06-20锛岄噾棰濓細楼7799.00銆傜鎮ㄥ叆浣忔剦蹇紒','馃彣',1,'2026-06-18 01:14:43'),(8,'ysn','HOTEL_ORDER',31,'閰掑簵棰勮鎴愬姛','鎮ㄩ璁㈢殑濡傚閰掑簵宸茬‘璁わ紒鍏ヤ綇鏃ユ湡锛?026-06-19锛岄€€鎴挎棩鏈燂細2026-06-20锛岄噾棰濓細楼123.00銆傜鎮ㄥ叆浣忔剦蹇紒','馃彣',1,'2026-06-18 01:28:08'),(9,'ysn','HOTEL_ORDER',32,'閰掑簵棰勮鎴愬姛','鎮ㄩ璁㈢殑濡傚閰掑簵宸茬‘璁わ紒鍏ヤ綇鏃ユ湡锛?026-06-19锛岄€€鎴挎棩鏈燂細2026-06-20锛岄噾棰濓細楼115.00銆傜鎮ㄥ叆浣忔剦蹇紒','馃彣',1,'2026-06-18 01:29:56'),(10,'ysn','HOTEL_ORDER',33,'閰掑簵棰勮鎴愬姛','鎮ㄩ璁㈢殑棣欐牸閲屾媺澶ч厭搴楀凡纭锛佸叆浣忔棩鏈燂細2026-06-19锛岄€€鎴挎棩鏈燂細2026-06-20锛岄噾棰濓細楼105.00銆傜鎮ㄥ叆浣忔剦蹇紒','馃彣',1,'2026-06-18 01:39:01'),(11,'ysn','HOTEL_ORDER',34,'閰掑簵棰勮鎴愬姛','鎮ㄩ璁㈢殑棣欐牸閲屾媺澶ч厭搴楀凡纭锛佸叆浣忔棩鏈燂細2026-06-21锛岄€€鎴挎棩鏈燂細2026-06-22锛岄噾棰濓細楼105.00銆傜鎮ㄥ叆浣忔剦蹇紒','馃彣',1,'2026-06-18 01:51:47'),(12,'ysn','HOTEL_ORDER',35,'閰掑簵棰勮鎴愬姛','鎮ㄩ璁㈢殑璇鸿灏忛厭搴楀凡纭锛佸叆浣忔棩鏈燂細2026-06-20锛岄€€鎴挎棩鏈燂細2026-06-21锛岄噾棰濓細楼7799.00銆傜鎮ㄥ叆浣忔剦蹇紒','馃彣',1,'2026-06-18 01:57:46'),(13,'caq','HOTEL_ORDER',36,'閰掑簵棰勮鎴愬姛','鎮ㄩ璁㈢殑鐞惇澶ч厭搴楀凡纭锛佸叆浣忔棩鏈燂細2026-06-19锛岄€€鎴挎棩鏈燂細2026-06-20锛岄噾棰濓細楼9888.00銆傜鎮ㄥ叆浣忔剦蹇紒','馃彣',1,'2026-06-18 02:02:23');
/*!40000 ALTER TABLE `system_notice` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tour_route`
--

DROP TABLE IF EXISTS `tour_route`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tour_route` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `intro` text,
  `days` int DEFAULT NULL,
  `price` double DEFAULT NULL,
  `distance` double DEFAULT NULL,
  `duration` varchar(50) DEFAULT NULL,
  `service_include` text,
  `service_exclude` text,
  `images` varchar(255) DEFAULT NULL,
  `notice` text,
  `merchant_id` bigint DEFAULT NULL,
  `audit_status` int DEFAULT NULL,
  `create_time` datetime DEFAULT NULL,
  `update_time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tour_route`
--

LOCK TABLES `tour_route` WRITE;
/*!40000 ALTER TABLE `tour_route` DISABLE KEYS */;
/*!40000 ALTER TABLE `tour_route` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `password` varchar(255) DEFAULT NULL,
  `username` varchar(255) DEFAULT NULL,
  `token` varchar(255) DEFAULT NULL,
  `role` varchar(20) DEFAULT 'USER' COMMENT 'USER/MERCHANT',
  `status` varchar(20) DEFAULT 'NORMAL' COMMENT 'NORMAL/BANNED',
  `phone` varchar(20) DEFAULT NULL COMMENT '鑱旂郴鐢佃瘽',
  `email` varchar(100) DEFAULT NULL COMMENT '鐢靛瓙閭',
  `shop_name` varchar(200) DEFAULT NULL COMMENT '鍟嗗鍚嶇О',
  `shop_description` text COMMENT '鍟嗗绠€浠?,
  `avatar` varchar(500) DEFAULT NULL COMMENT '澶村儚URL',
  `ban_expire_time` datetime(6) DEFAULT NULL,
  `age` int DEFAULT NULL,
  `ban_reason` varchar(255) DEFAULT NULL,
  `create_time` datetime(6) DEFAULT NULL,
  `gender` varchar(255) DEFAULT NULL,
  `shop_address` varchar(255) DEFAULT NULL,
  `shop_phone` varchar(255) DEFAULT NULL,
  `update_time` datetime(6) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` (`id`, `password`, `username`, `token`, `role`, `status`, `phone`, `email`, `shop_name`, `shop_description`, `avatar`, `ban_expire_time`, `age`, `ban_reason`, `create_time`, `gender`, `shop_address`, `shop_phone`, `update_time`) VALUES (1,'111','ysn','894f045e-56f5-4a55-957b-b579cba90177','USER','NORMAL','13809523654','1459858632@qq.com',NULL,NULL,'/file/e4b98d92-de16-497f-816c-896e040268fc_8NTqaMiYQ5kIa4e9d641308a07ed2108b8bc489e32e9.jpg',NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2026-06-18 03:13:27.869000'),(2,'111','caq','7183b372-e926-44b4-99c0-07bdc1680e67','USER','NORMAL','15836547892',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2026-06-18 02:03:04.037000'),(3,'111','ldq','5f516f48-981f-411e-a4c0-22c94b8a1d67','USER','NORMAL','13658972369',NULL,NULL,NULL,'http://localhost:8080/file/1fe55820-c31d-4a18-b7fb-9be0674931c8_QTlenSls86OM7e45bd08493ad5b8393b6aa8852fb77e.jpg',NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2026-06-24 08:46:29.848000'),(4,'123','濡傚','ac886836-2679-41e2-8c67-cae56f6641b4','MERCHANT','NORMAL','12345678910',NULL,'濡傚澶ч厭搴?,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2026-06-24 09:20:04.076000'),(5,'123','棣欐牸閲屾媺閰掑簵','1978b45c-b281-4788-bcd8-ad03f20ae425','MERCHANT','NORMAL','13809521364',NULL,'棣欐牸閲屾媺閰掑簵',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2026-06-18 01:51:59.061000'),(6,'123','璇鸿','15a48690-8177-4235-8857-51d009973d03','MERCHANT','NORMAL','15980567632',NULL,'璇鸿澶ч厭搴?,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2026-06-18 04:10:14.817000'),(7,'123','鐞惇','18b65f38-ef9c-4a7d-962e-bd9d96c69198','MERCHANT','NORMAL','13856428974',NULL,'鐞惇澶ч厭搴?,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'2026-06-18 03:15:13.748000'),(8,'111','sqy',NULL,'USER','NORMAL','18965473256',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL),(9,'123456','鑻忓阀浜?,'f9707258-ab60-4f8f-b481-1e2ea0bc3f85','MERCHANT','NORMAL','15777141235',NULL,'鑻忚嫃澶ч厭搴?,NULL,NULL,NULL,NULL,NULL,'2026-06-23 02:44:57.311000',NULL,NULL,NULL,'2026-06-23 02:48:53.542000');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-06-24 18:07:02

